{"podcast_details": {"podcast_title": "Fresh Air", "episode_title": "Humorist R. Eric Thomas Wonders If The 'Best Is Over'", "episode_image": "https://media.npr.org/assets/img/2022/09/23/fresh-air_tile_npr-network-01_sq-a6f7c547c8e78b8230edc7fc3c32005de3756e0d.jpg?s=1400&c=66&f=jpg", "episode_transcript": " This is Fresh Air, I'm Tonya Mosley, and today we're talking with author and humorist R. Eric Thomas. You know that expression, you can never go home again? It's a reminder of how nostalgia can sometimes warp our sense of the past. R. Eric Thomas' new book explores what it actually feels like in practice to go back to the place where you were born, especially when your relationship with that place is complicated. The book is called Congratulations! The Best is Over, and it's a series of humorous essays recounting Thomas' journey back to his hometown of Baltimore. After going off to college, Thomas thought he'd left the city in the rearview mirror, until his husband got a new job there, forcing him to wrestle with the life and version of himself he thought he'd left behind. R. Eric Thomas is a television writer, playwright, and author of the bestselling book Here for It or How to Save Your Soul in America, reclaiming her time, the power of Maxine Waters, and the young adult novel Kings of Beemore. Thomas is also the long-running host of The Moth in Philadelphia, and previously a senior staff writer for Elle Online, which he wrote the popular Eric Reads the News column. R. Eric Thomas, welcome to Fresh Air. Tanya, I am so excited to be here. Good to talk to you. I know, me too. I'm glad to have you. So you call this book of essays a coming of middle-age collection, and I love that so much because there really aren't enough middle-aged stories out there. How does it feel to be in your new form as a middle-aged person? You're 41, right? I'm 42, but I look 27. It feels, you know, I have to say, it's every time I hear that phrase, which I made up and have been using to promote this book, I also cringe a little bit, not because I don't want to be the age that I am, but because of the question inherent in the title, like, is the best over? You know, my therapist, Brian, my former therapist in Baltimore, was talking me through some of the issues I was having adjusting to living at home, and he was like, you know, this is a very normal thing for you as you move into middle-age. And I was like, move into where? Like, no, no, no. Because I, you know, like, and I would tell him about, you know, my parents' experience in middle-age, where in their 40s, they were going through job stress, and they lost their parents, and they had kids that were both achieving but also struggling. And you know, by the end of my parents' 40s, all their parents had died, and I had dropped out of college, and I was moving back, living back at home, and they were hard years. And I didn't want to live hard years. But I also remember that as a time of achievement. My mother got her doctorate. My father moved into the job that he would eventually retire from. So I, every decade of my life has been better than the one beforehand, and I want to believe that this decade also, and the decades further, will be also really wonderful. I think you heard you say, I heard you say that this book explores the middle, not just in an age sense, but what it's like when you're in transition from one point of life to another. That's exactly what you're saying here. And so your move from Philadelphia back to your hometown of Baltimore after your husband takes a job as a pastor there was one of those big transitions. It was very much a middle space that you were in. This was a big deal because you used to actually say, I don't even want to move back to Baltimore to be buried, which is a very powerful statement. Well, and I, you know, and I hesitated to put that in the book, but it was true. And of course it ended up on the book jacket. So you know, but it is where I begin in this story. And you always have to go someplace in a story. The place I began was in this really fraught relationship with the city. And it's not the city's fault, but Baltimore is a city that has gotten a pervasively bad rap. And I knew that as a resident, I knew that as somebody who lived on a block where they would film the television show homicide and the television show, The Wire. And so like not only was my block a place that had been redlined into desolation and disrepair, but it was so convincing as a place of no hope that it was used as a Hollywood backdrop for a cautionary tale for years on television. And so I thought to myself, when I got out of Baltimore and moved to Philadelphia and found myself through storytelling, through community, through therapy, and eventually through love, which I talk about in here for it, I felt for a while that if I went back to Baltimore, I would lose all that, like a spell breaking. And then I found myself there with my husband, with the person that I found in Philadelphia. And I was surrounded by the ghosts of the person that I used to be. And I would tell him these stories as we rode around town. I just point to things and say, oh, that's where I was in an attempted carjacking. And oh, I had a really bad experience here. And I got thrown out of this cab here because they didn't want to go to my neighborhood. It was too dangerous. And David was like, David's my husband. He was like, did you know that every story about Baltimore is the saddest thing I've ever heard? And I was like, I'm just making color commentary. But I needed to find new stories. And that's the journey I go on in this book. You mentioned your childhood in Baltimore. You left to go to college. You pretty much never went back for any extended amount of time. But this area that you grew up in, as you said, it had been redlined for more than 40 years. Did those depictions that you saw on television and the wire, for instance, did they feel accurate or affirming? Or was it hard for you to watch? It felt like the way that the neighborhood was designed to function, which was not the way that life functioned inside of my parents' house. And here for it, I describe my growing up as being inside of a bubble. And we describe people who live in a bubble as out of touch. And I think that actually we were deeply in touch. Bubbles are also transportation devices. They lifted us out of the mire of the circumstances that are outside our door, the crime, the violence, the lack of opportunity, and into a sense of self that was positive and full of possibility. My parents told me and my brothers that we could do anything. And then they showed us. They showed us in libraries and in love and in taking us to different schools and taking us out physically out of the space, but also creating a world inside of the house that was different than the world outside, not because we were better than any of those people, but because it was important for us to have a different narrative. So when I would watch The Wire, I had this weird experience. I came back right after college and I was substitute teaching and I didn't know what I was doing. And I'm so miserable. And I would come out of my house in the morning and I would find people who I perceived to be people who were addicted to drugs waiting for an open air drug market sitting on the step, which was not an uncommon occurrence. And I'd make my way through them. I'd say, excuse me, wrong steps. And then I turned the corner and there'd be a craft services table. And then I have to go back and be like, wait, are you actors? And they'd be like, oh yeah, we're actors. I was like, well, get off my steps. And it's hard to know if you're in the right story, if the story around you is constantly telling you that there is no hope for you. And I just knew that wasn't true. I thought it was really interesting. I think it was around the time The Wire came out or it was like at its height. You wrote this young adult novel called The Kings of Beemore, which is set in Baltimore. It's about two queer kids having a very Ferris Bueller's day kind of day off. I love how you say writing this allowed you to tell a story of Baltimore that is not rooted in trauma. Yeah. Yeah. I wrote Kings of Beemore in 2020, so a little bit after The Wire. But I was very invested in telling a new story of Baltimore. And at this point, The Kings of Beemore is my third book. It was my first novel. And I was like, oh, I am the storyteller now. This is no disrespect to the creators of The Wire. It's not about Eric versus The Wire. I think it's a very good show. And there were many years where every white person I met who I told I was from Baltimore, they would say, I love The Wire. The Wire, right. As if that was a compliment to me personally. So I would say, thank you. But Kings of Beemore is an opportunity to tell a different story. And I don't see it as wish fulfillment or fantasy. I see Baltimore as a city of art and music and food. It's a very Black city. It is also a very diverse city. It's a city where there's a lot of queer opportunity and queer community. And I wanted to give that to readers. And I wanted to give it to two Black teens who don't experience homophobia inside of the book, who aren't experiencing racism inside the book. And it's not like it doesn't exist. It is very much a part of the world because they live in the real world. But I knew that it was possible for them to have a story where the reason that we're telling the story is not to remind the reader that it is hard to be them. It's to remind the reader that as humans, they have such a great capacity, these two boys have such a great capacity for love and for hope. Because I know that's true. That's something that I fought very hard for myself. Your parents really provided you this space within Baltimore. So there was home. There was that interior life. And then there was what was happening all throughout the city. You also grew up in an evangelical Christian community. And your last book, before this one, actually ends with you marrying your husband, David, who is a pastor. I think you actually said that that ending sounded too perfect, which it kind of does too. But you had to grapple with a few things between childhood and getting married around your sexual orientation and your faith. I did. I did. And it's another one of those stories where I thought that there was only one narrative and I thought that there was only one ending. And the church that I grew up in, not only was there very negative messaging around LGBTQ people, but there was also this narrative that I intuited that was about suffering and that we deserved to suffer. And I looked around at these people that I loved so much. It was an all-Black church and most of the people were lower middle class or lower class. And I said to myself, I think some of the suffering is not actually rooted in sin or our inherent badness. I think some of this is actually systemic. I didn't have that word back then. I was 13. But I struggled with this idea that we were in the wrong story too. And so I searched for faith community for a long time. One time I went to visit a church with my good friend Jake, who also grew up in evangelical spaces and was searching for a church room that would accept him. And we found this church that was open and affirming and we went and everybody was wearing a rainbow pin and they were so excited to see us. And we had accidentally dressed exactly alike. And so we looked like boyfriends or missionaries or I don't know, maybe missionary boyfriends. And we weren't, we were just friends. And we were like, oh, you know, it's great that you have a lot of gay people here. This is wonderful. And they're like, oh, we don't, but we really want to. And that was lovely. But we wanted to be in a space where we actually were both welcomed, wanted, but also we already were. And so what I found when I found David's church, the conflict of course about finding a church that was open and affirming and had a queer pastor and many other queer people is that then I had to decide, do I want to be a congregant or do I want to be a boyfriend? Because you can't be both. So you can't be both. No, you know. And so then I was like, what a romcom dilemma I'm in. And so then I did nothing. What do you mean you can't be both? Well, you know, David would not date a congregant, which is, I think, morally right and spiritually healthy. And so if I was going to him for spiritual guidance, for mentorship, for community, then I couldn't be pursuing a romantic relationship with him. He has very clear ethical boundaries, which is new for me. I was like, ethics? Oh, my goodness. What? And so we met at a panel at the LGBT Community Center and I was so compelled by him and his ability to tell stories. And I was like, I want to go to your church, which I didn't know put up all the guardrails. And so he gave me his business card and I was like, okay, well, I can't text emojis to this and you know, good morning boo. You know, I can't do that. So I did nothing. But then he showed up at a one person show I was doing, a storytelling show that I it was called Always the Bridesmaid and it was about a search for God. The tagline was search for God, boys and baked goods. It was just about how I wanted to find a religious community and I wanted to find love. And sitting right there in the audience, I found both. So you all found this community in Baltimore through your husband's church. And I'm also wondering how that was their interaction with your family's church as evangelical Christians as well. You said they weren't going to the same church that they did that you grew up in. But did that come together in a way that felt like you could be a part of a larger community, the one that you grew up in, in a sense that involved your parents in this new place that you found? Well, it's fascinating to me because as I've gone on this journey of writing books, I have had different experiences where I've done book events and people from the old church and people from my parents' new church, which is more progressive, and people from David's church, which is very progressive, have all sort of been in the audience. And I look out and I think to myself like, oh, is this church too? And I am of the belief that sometimes church is the building. Sometimes it is the walls and the door and the stained glass and the choir loft and the smell of perfume and old hymnals. And that's great. That's a wonderful sensory experience. But sometimes church is literally wherever the people are. And so church for me sometimes is a Beyonce concert or a gay bar on a great night or a car ride with one or two other people where we're really connecting with each other. And so I hungered, I think I kept looking for the building that I was supposed to walk into where they would say, you are home. And I don't know that that building exists. Maybe that's heaven. Maybe I'll get there and see it. And I'll be like, oh, I've been looking for this. But in the meantime, there are these churches all over this earth. And I'm grateful for that because there was never a moment where everything knit itself together. There are plenty of moments of welcome and change and new stories. But there was never for me, because of the story that I'm living in, I think, a moment where everything all came together. You have this chapter in the book called Clap Until You Feel It. And it's about the yearning. This is specifically about the yearning during a depressive state to feel something. That just makes me think of what you just said about finding church in places and spaces in this Beyonce concert and the Taylor Swift concerts that are happening now. It's become like a thing. It's bigger than I really ever remember before the pandemic concerts being. I actually have friends who are now traveling from state to state to go to Beyonce concerts. They're middle-aged women who have careers and families, but they are trying to connect to a thing. They're trying to have that feeling, that religious experience in a way. Oh, yeah. Yeah. I went to, I saw Beyonce in DC a little while ago, and I've never felt so deeply connected to myself, to the other people in this space. We're soaking wet. And so it felt like, and every time I've seen Beyonce recently, it's been soaking wet. And I'm like, oh, this is also this sub baptism. And I don't mean it sort of is not connected to Christianity per se. It is connected to a deeper sense of your soul and something bigger. And I was like, I get why people are roadies. I get why people go see Broadway shows like Hadestown or Kimberly Akimbo 30, 40 times. I get why I go back to the page and to write plays, to write television, to write books. But specifically plays, I think about like, I am trying to get to this palace of big feelings, this place where I can not be neutral, where I can be in a room full of people who are feeling something very specific, but also the same thing. To be in a space where everyone is feeling a joy or a pain or excitement, whatever it is, whether it's a funeral or a concert or a church or theater or whatnot, it is to be reminded that you are human and that you are not alone. And that is so crucial a reminder for me. Our guest today is our Eric Thomas, author of a new collection of essays called Congratulations, the Best is Over. Before after the break, I'm Tanya Mosley and this is Fresh Air. I'm Fresh Air's Anne-Marie Baldonado back in your feeds with a reminder about our Fresh Air Plus bonus episodes. Hip hop music just turned 50 and to celebrate, we're listening back to Terry's interview with Grandmaster Flash. You know what I'd like to do? I'd like to hear that again, but this time keep your microphone on and have you describe what you're doing as we listen to it. If you want to hear what that sounds like for yourself, subscribe to Fresh Air Plus at plus.npr.org. This is Fresh Air. I'm Tanya Mosley and my guest today is author and humorist, our Eric Thomas. He's written a new series of essays called Congratulations, the Best is Over, which recounts Thomas's journey back to his hometown of Baltimore. This is the author of the bestselling book Here for It or How to Save Your Soul in America, reclaiming her time, the power of Maxine Waters and the kings of Beemore. Okay, so Eric, you and I were guests on a show together back in 2019. It was Bill Ratke's show, The Record on KUOW in Seattle and you were there to host a Moth event and the topic was how to feel joy when the world is burning. We talked about anxiety, we talked about our complicated feelings about home. This was before the pandemic. I mean, I'm actually just laughing at this because it's like, okay, we didn't have anything to worry about by comparison. One thing you said is that you have anxiety around performing for people in your day to day. Like you get anxious in social situations because you think you might let people down. Do you think that people have an expectation that you will make them laugh? Is that what it is? I think so. It's so funny. Literally during the break, I was like, am I being funny enough on this interview? But now that I've said it, the genie's out of the bottle and who knows, whatever. But I do think people will see me at the Moth, which is I think it's another church for me. It is a place where I feel most at home, most at live in front of an audience, riffing, telling stories. And people will come up to me and my husband and they'll say, oh, Eric must be so fun at home. You must laugh all the time. And he's very gracious. He's always like, yeah. And I'm like, no, I'm very boring at home because at home I'm like, oh, I did the budget or oh, the dishes or the most boring, quotidian stuff. So I do feel this pressure, but I think it is self-imposed where I am trying to marry what I feel is the ultimate form of myself, the platonic form of myself, which is someone on stage and telling stories and being in community, but also contributing to the life of the community. I'm trying to marry that with the quotidian and with a person who is just reading a book on the subway. Sometimes I'm like, you're not going to do everything funny, but I want to. Oh my gosh, I'd love to. Right, because I mean, okay, so I listened to a talk you did. I think it was at the library in Philadelphia. It turned into a podcast, but it was a talk that you did and the audience was in the palm of your hand. I mean, it was roaring laughter with every single punchline and that's got to feel good for you. But then you don't want to be that person at a dinner party, I'm guessing. So you're not going to give punchline after punchline, you're going to be a human being. So that's what's going through your head is the mix of both on how to be just a person, but also make people like you and laugh. Yeah, I mean, it's something that I work through in therapy a lot. I'm also sort of like, you said you don't want to just be punchline after punchline, you want to be a human being. And I was like, I don't know. I don't know about being a human. Being a human, overrated. Every part of my body hurts at all times. But I do, I do have this desire to be real and I don't want to put a barrier between myself with humor. And one of the things with the way that my humor has developed over the course of the years, it used to be very self-deprecating. And I realized, oh, that's a person who doesn't like themselves. And as I started to like myself, my stories changed. I used to tell this story about joining the gay softball league here in Philly. And a lot of the story for a long time was just about like, oh, I was so bad at softball and I was too gay for the gay softball league. Which I was, they put me in far right field. I was the right fielders understudy. And I was singing damn Yankees and they're like, we don't need this right now. But ultimately I realized as I grew to love myself and appreciate who I am, I was like, oh, this isn't a story about how bad it is to be an eccentric trying to play softball. This is a story about the drag of masculinity and putting on the drag of sportsmanship in the interest of making community. When I realized that, the story changed and the jokes changed and it became a funnier story actually because I wasn't punching down on myself. Like why? The world will do that enough for me. You're a screenwriter. As we know, the writer Strike has put any television and film writing on hold. I think I read somewhere where you said if the union doesn't get all the things they're asking for on behalf of its members, you might not feel like there's a future for you in television. Yeah. And I think that's, I'm very fortunate because I have written for a couple of television shows. I have written for a couple more television shows. I am in a small minority of people in terms of the ability to make a living off of television and to see my work fairly compensated. But we are in this existential struggle for fair compensation, for opportunity, particularly as a black screenwriter and as a queer screenwriter. There is a lot of back and forth about authenticity and voice. We want your voice. We want your story. But there is also this belief that at the end of the day, this room is built for a certain kind of person and it's not that person. And so one of the things that the Strike is about is about making sure that the doors of the rooms stay open, that the walls stay expanded, that we're not shrinking down to one kind of person or to one kind of voice generated by computer, by AI. I don't know. I don't know what the future looks like for me in television. It's only been a couple of years, but I'm very, very proud to be on Strike. It's the first time I've been on Strike, first time for me to be in a picket line, but I come from a union family. My mother for years was a member of the Baltimore City Teachers Union. And I understand the power of unions. And it is another community. It is another space that says we exist in our fullness and we cannot be bullied or ignored or told to be smaller, to be less, or to try to survive or nothing. You know, I was thinking about how many writers and other folks in the industry have probably moved on to other jobs already and what that actually means for storytelling and representation, as you mentioned. Just thinking about what a long-term strike over time as people who have just gotten into the industry like you are being forced to make these choices, to find other ways of surviving. Yeah. But I think one of the things that's always been true is that most of us are already doing multiple things to survive. There's very, very few people who are making a living fully as screenwriters. And for instance, I'm talking about my new book. And so I'm fortunate that I get to write in multiple mediums. But it also, if we don't return, either because the strike makes that, not the strike, the actions of the studios make it impossible or because we choose to go seek our stories elsewhere, it robs everybody of a possibility. And that is not the strike. That's not the WGA's fault. That's not the striking writer's fault. That is, people who have the power to say like, we want to tell more stories, refusing, abdicating that power. And if we don't see ourselves on screen, on television, then we don't know necessarily that all the different parts of our stories are possible. That's very important to me. If you're just joining us, our guest today is television writer, playwright, and author R. Eric Thomas. He's written a new book of essays called Congratulations, The Best is Over. We'll continue our conversation after a short break. This is Fresh Air. You know, a big part of your writing, which all great writers do this, but a thing that you do is kind of like put, you put a stake in the ground for really important moments. In 2020, you wrote this powerful article for Elle called It Doesn't Matter If You're Good. And just to put it into context, you wrote this article just days after George Floyd was murdered. And in it, you write that as a black man, you learned at some point how to perform being non-threatening. And you learn that often it matters less how well you perform and more whether the audience for said performance believes it or wants to believe it. And you go on to say that it's futile anyway, because if I am powerless over the reception that I get, what does it matter how I approach the world? And I'm just wondering about that because you have such a disarmingly funny and approachable disposition and part of that is obviously just who you are. But some of it maybe is also another layer of you putting on in a way that makes you non-threatening. And when I say put on, I don't mean it as a fake thing, but it's part of your personality as a core of how you've been able to move through the world. Is that how you see it? Is that true? I think that I have had to learn a very hard lesson about the difference between performing obsequiousness, performing belonging for white people, and then just performing myself. And I think that I've moved to a space where I am more performing myself. And I think that many, if not most or all black men, men of color, learn how to indicate to others, to people who are not black, to white people particularly, that they are not going to do whatever boogeyman fantasy that these people have cooked up. And sometimes, yes, sometimes that is paranoia, but that paranoia I think is rooted in lived actual experiences. When I wrote that article for Elle, it was also days after Christian Cooper, the birder in New York, had the police called on him for birding. And a CNN reporter, I believe his name is Omar Jimenez, was reporting on protests and was arrested live on television. And a lot of the commentary around both of those things was, can you believe this? These people are so presentable. He's a glasses wearing birder. And I was like, you shouldn't have to be a glasses wearing birder for people to be shocked. You co-wrote Apple TV Plus's Dickinson and FX's Better Things. What is it like collaborating with other writers in the writers' room? It is like nothing I've ever experienced. I wish you could do a writers' room for a book or for a play or for what I'm having for breakfast. I really like, I always want that level of feedback. And it's just so exciting to be circling an idea and putting, it's like you're making stone soup like that book. You're putting a little bit in and someone else is putting a little bit in and you're agreeing with each other and you're learning from each other. The Dickinson room, it was over Zoom and the first time I logged in, I looked at the screen, little squares and in one square I see Ziwei, the comedian and author and television host. That point she was mostly writing and comedy. And I see Lynn Nottage, an icon, one of my idols. And I was like, oh, I'm in the wrong room. But if I close my laptop and log back in and I wasn't in the wrong room. And so to be in that space with them and so many other people was both affirming and also just so invigorating as a writer because you learn to think how other people think and that gives you more tools and makes your world bigger. I'm wondering, you have such an affinity for storytelling and you use all the mediums to tell stories with the moth, with the written word. What were the storytellers that you admired growing up? I first learned about using your voice as a comedic weapon and comedic tool from reading David Rakoff and David Sedaris. Incredible, incredible writers, incredible like queer perspectives. I also learned a lot reading, you know, people who are not writing narrative nonfiction. I learned a lot about storytelling from Toni Morrison. When I first read Colson Whitehead, all the lights in the house of my mind went off or went on, I should say. And so, you know, those were, you know, Colson Whitehead, I think his first book, the first book I read of his was The Intuitionist, which was I think I read that maybe right before I went to college. And I was just like, oh, this person is using every tool at his disposal to tell a really complex and beautiful story. And I've been hooked ever since. What is your relationship with Baltimore today? Has it changed after that experience living there? Oh, yeah. Oh my gosh, it has. And I think of the city now in its, I realized that I was not giving the city a fair shake and that I was doing the same thing that those people would do to me. I was like, I know how bad it is. I know all the local politics. I know they can't get the red line together, which is a subway that they've been talking about building for 30 years and they really should build. And I realized, okay, if I'm not letting Baltimore be new, then why should I get to be new in this city? And Kings of Beemore was the turning point for me. Kings of Beemore is a book about the city in all of its beauty and its diversity and its possibility. And it wasn't hard to write. It was the easiest. It was the quickest writing process of all my books and the most fulfilling. And I said to myself, oh my, oh, this place that I felt such pain in. I get to craft this story that is nothing but joy for me and hopefully for others. So I worried when I was writing Congratulations, the Best is Over that people who live and love Baltimore would see the same old story getting played out that they would say, oh, this person, yet another person trashing Baltimore. But you know, the response so far has been people saying, I understand that it's a journey sometimes, but I got to the end of the journey. R. Eric Thomas, thank you so much for this conversation and for this book. Thank you. Thank you for having me. Our Eric Thomas's new book of essays is called Congratulations, the Best is Over. Coming up, jazz critic Kevin Whitehead reviews a new collection of recordings by pianist Sonny Clark. This is Fresh Air. Jazz pianist Sonny Clark grew up in and around Pittsburgh and made his first recordings in L.A. during the heyday of cool jazz in the 1950s. He later moved to New York in 1957, where the hotter music was more to his taste and signed with the prestigious Blue Note label. There's now a new box set collection of all of his Blue Note recordings. Jazz critic Kevin Whitehead has this review. a tune, News for Lulu, 1957. Clark was his own man on piano. You could hear what he owed to Horace Silver's grooving and Bud Powell's complexity, but Clark had his own fleet, nimble, carefully crafted, personal style. His fingers are pistons dancing on the keys, making the strings sing out. And he's swinging all the time, even playing a single note. His fluent lines can be almost glib sometimes, but bluesy feeling keeps him grounded. Sonny Clark with Paul Chambers on bass and Philly Joe Jones on drums. The pianist holds his own at that quick pace, but medium tempos give Clark more room to fine tune his timing and force at the keys. At a 1959 take of his tune, Royal Flush, Clark organizes his stealthy solo around a catchy, rotating figure that's not part of the melody, as if he's composing in the moment. Sonny Clark recorded nine sessions for Blue Note, between 1957 and 1961. His excellent rhythm partners include drummers Lewis Hayes, Arthur Taylor, and Billy Higgins, and bassists Wilbur Ware and Jimmy Merritt. On the piano's altered blues, some Clark bars. Bassist Paul Chambers and drummer Art Blakey give the beat almost a country lope. The blues as folk music. They're bass and drums that fit right into a rockabilly band. Blue Note recorded Sonny Clark in trios and in quintets and sextets with excellent horn players. They include Art Farmer, Donald Byrd, or Tommy Turrentine on trumpet, trombonist Curtis Fuller, and on saxophones John Coltrane, Jackie McLean, or Clifford Jordan. The scene stealer on Clark's 1959 LP My Conception is tenor Hank Mobley, who is having a very good day in the studio. Clark's ballad My Conception taps Mobley's romantic side. By 1961, when Sonny Clark recorded his fine and final Blue Note album Leapin' and Lopin', he'd been spending a little time around Thelonious Monk and was feeling his influence. For this date, he hired Monk's saxophonist Charlie Rouse and a tuneful bassist Monk would hire later, Butch Warren. Monk's influence is playing on Clark's riffing tune Voodoo and on his stubborn piano under Rouse's solo. Fourteen months after recording Leapin' and Lopin', Sonny Clark died of a heroin overdose at 32. Such music he'd recorded sat in the vaults until the 1970s when his rediscovery by Japanese jazz fans in particular prompted Blue Note to gradually release all his stockpiled recordings. Now we have in one place everything he recorded for the label as leader. The six CD Sonny Clark Roundup, the complete Blue Note sessions, comes from Web Order House Mosaic Records with expert program notes by Blue Note authority Bob Blumenthal. Sonny Clark deserves such first class treatment. He's playing brims with the crisp, tuneful creativity that draws listeners to jazz in the first place. Kevin Whitehead is the author of the book Play the Way You Feel, the essential guide to jazz stories on film. He reviewed Sonny Clark, the complete Blue Note sessions on the Mosaic label. Tomorrow on Fresh Air, Marshall Project journalist Maurice Chama joins us to talk about music programs in prison. He explores how art and music can help build hope and dignity within prison walls and helps us understand the mindset of those who commit crimes and are imprisoned. I hope you'll join us. To keep up with what's on the show and to get highlights of our interviews, follow us on Instagram at NPR Fresh Air. Fresh Air's executive producer is Danny Miller. Our technical director is Audrey Bentham. Our interviews and reviews are produced and edited by Amy Salat, Phyllis Myers, Sam Brigger, Lauren Krenzel, Heidi Saman, Theresa Madden, Anne-Marie Baldonado, Thea Challener, Seth Kelly and Susan Yakundi. Our digital media producer is Molly C.V. Nesbur. For Terry Gross, I'm Tonya Mosley."}, "podcast_summary": "R. Eric Thomas, author and humorist, discusses his new book of humorous essays called \"Congratulations! The Best is Over.\" The book reflects on Thomas's return to his hometown of Baltimore and explores themes of nostalgia, belonging, and personal growth. He also discusses his experiences as a middle-aged person and his journey of self-acceptance. Thomas shares insights into his writing process and his love for storytelling. He also touches on his career as a screenwriter, the challenges faced by writers in the industry, and the importance of fair compensation and representation. Thomas reflects on his relationship with Baltimore and how his perspective of the city has evolved over time.", "podcast_guest": "R. Eric Thomas is an author of Here For It, a playwright, and television writer. He is best known as the author of Here For It, a National Bestseller.", "podcast_highlights": "Author and humorist R. Eric Thomas discusses his new book of humorous essays, \"Congratulations! The Best is Over,\" which explores his complicated relationship with his hometown of Baltimore. Thomas talks about the concept of \"coming of middle-age\" and the transition from one phase of life to another. He also discusses his experiences growing up in Baltimore, the negative portrayals of the city in popular media like \"The Wire,\" and how he learned to tell a different story about Baltimore through his writing. Thomas also reflects on his journey of self-acceptance as a queer black man and the intersection of his faith and sexuality."}