{"podcast_details": {"podcast_title": "Wait Wait... Don't Tell Me!", "episode_title": "WWDTM: Damian Lillard", "episode_image": "https://media.npr.org/assets/img/2022/09/23/waitwait-don-t-tell-me_tile_npr-network-01_sq-d51413832c7ccf5301741d7f1ee2e1853fed9597.jpg?s=1400&c=66&f=jpg", "episode_transcript": " from NPR and WBEZ Chicago this is wait wait don't tell me the NPR News Quiz I'm the voice so deep you can do a cannonball in it. Bill Curtis and here is your host at the Arldein Schnitzer Concert Hall in Portland Oregon Peter Sego. Thank you everybody. Thank you so much. Great to see you too. I feel the same way. We are very excited to be joined later on today by a very successful local entrepreneur. He owns a car dealership outside of Portland. It's called Damien Lillard Toyota. Mr. Lillard when he is not selling cars has a side gig as the perennial all-star point guard for the Portland Trail Blazers. We'll be talking to him later. Our tip-off is right now. Come to Center Court, grab your phone, jump up and call 1-triple-8-wait-wait. That's 1-888-924-8924. Now let's welcome our first listener contestant. How you run wait wait don't tell me. Hi this is Erin Briskey from Newport Rhode Island. Oh how are things in Newport right the former yachting capital of the world or maybe the current I don't know. I don't yacht. Things are great here. We actually just got back from the 1975 documentary Jaws. It's basically all we do here in Newport is just sit around watch Jaws. Really that's why that's why all those those millionaires moved there in the 19th century. Well take in the Nickelodeon about the shark. That's the tradition in Newport. Okay welcome to our show Erin. Let me introduce you to this week's panel. First a comedian you can see in Dallas at Hyenas on August 25th and the 26th. It's Helen Hong. Hi Erin. Hi everybody. Next host of the public radio variety show Live Wire and the daily podcast TBTL which will be recording its 4,000th episode at the Neptune Theatre in Seattle July 29th. It's Luke Burbank. Erin pay no mind they're just excited for Dame Lillard. Yeah and finally you can see her in San Francisco at the Presidio Theatre on September 8th. Her podcast is Nobody Listens to Paula Poundstone. It's Paula Poundstone. So Erin of course you're gonna play who's Bill this time. Bill Curtis is gonna read you three quotations from this week's news. If you can correctly identify or explain just two of them you will win our prize. Any voice from our show you might choose for your voicemail. You ready to go? I am ready. Well then. Very ready. Well we won't make you wait. Here's your first quote. Wake up it's Barbenheimer day. That was a movie fan on Twitter talking about what variety called the movie event of the year. The simultaneous premieres this weekend of what two movies? Oh man Barbie and Oppenheimer. Yes Barbie and Oppenheimer. I am become Barbie-heimer savior of multiplexes. Now Barbie-heimer is not to be confused with Oppenheimer Barbie who comes with a fedora and a little pink atom bomb. And a checkered past. Yes. Are you guys excited to see either or both of these films? I kind of feel a little bit bad for Oppenheimer because the Barbie movie has so much better merch. You know they have the pink t-shirts and like you can get roller skates and like what can you know there's no Oppenheimer roller skates. I'm gonna say I find that I find that troubling. I hate it when art is commercialized. I will be so upset if they come out with like a Barbie action figure. Oh yeah. I got some bad news for you. So this this this event Barbenheimer has been hyped for months. AMC theaters reported that as of last Monday more than 40,000 people had already bought tickets to watch the two movies back-to-back. It's great there's finally a double feature for that annoying amateur World War Two historian and his fun niece. It feels like a real emotional rollercoaster though. Yeah. Like you got to make sure that you I think you have to see Oppenheimer first right? Well there's a debate about that. What do you think? I mean I start most days with Oppenheimer. It's just like yeah. Part of your routine. But no you got to start with Oppenheimer then you have brunch with your friends you have a conversation about this very serious film you saw then you get extremely drunk you naked bike ride to a different this is Portland so right trying to relate to the local population well and you then go or maybe naked rollerblade to the other movie theater and then you watch Barbie and you have a fun fun flirty time at the end of your day. I see. Yeah it's I kind of agree because it's hard to be like you coming out of Barbie and you're like yeah that was so cute. And now oh. Doing it the other way I mean having such a heavy thing the movie this three hour drama and then having Barbie and it's pink and it's fun and it's it's like putting a maraschino cherry on a cigarette. I believe that is a scene in Oppenheimer. It might well be yeah. Smoking and eating maraschino cherries. Yeah. Aaron your next quote was the actual readout on somebody's weather app that they looked at in Texas this week. Satan's butthole. That was this weather app's actual description of what it is like in Texas and all through the American Southwest during a historic what this last week. It's a really really hot heat wave. Yes it is in fact perhaps the worst in history. Welcome to the future everybody. It was the hottest June on record perhaps the hottest summer ever more than a quarter of the United States has been broiling in the hottest summer ever. In Phoenix it has reached at least a hundred and fifteen degrees every day for the last three weeks. True story. Okay. Hey maybe Phoenix you should not have named your city after a bird most famous for bursting into flames. We're blaming the victim here. Yeah I guess so. I am confused why it's always called a heat wave because the last thing you want to do when it's 115 is wave or move any part of your body like in that kind of weather you know you see your people that you know you just go. If you are if you are caught in this and and you just don't have the energy to make it to the movie theater you can sort of have your own Barman Heimer but you sit inside with the air-conditioning blasting that's the Barbie and then you go outside at noon that's Oppenheimer. Yeah how did that movie end by the way I'm not a history but I believe it ended well I believe it ended with a heat wave in New Mexico. Have we been able to rule out the studio executives not being behind the heat wave because I feel like if you're rolling some movies out yeah how you gonna get people in the theater make it the only place that is humanly survivable. And you know the Sun Belt centered in Arizona of course has a very large senior population do you know how dangerous it is to put that many old people and that much weather to talk about in the same place? Listen as we're reaching the near end of this planet you have limited time right can we treasure the moments we have by not having the local news give us tips for beating the heat? Because it's impossible. I feel like we're pretty up to speed on hydrate and try to stay indoors where there's air conditioning. There's not a lot more there's not like catch a leprechaun say these four words to them and ye body temperature will be better like there's no new beating the heat tips. It's so true and I always want to click on that clickbait like how to beat the heat and I'm like who tell me and I'm like water are you kidding me? This is how Moses was beating the heat when like a bush caught on fire and you don't use using water. Yeah all right Aaron here is your last quote. George Jetson had one 60 years ago what's taken so long? That was a New York Times commenter responding to news from the FAA that what will finally be arriving as early as 2025? Oh man is it is it jet packs? Oh I wish it's close. It's when we talk about George Jetson it's how he got to work. Flying cars. Flying cars specifically air taxis. Oh the FAA released their official plan for the rollout of these long dreamed of air taxis because who among us hasn't been in a cab and thought you know that guy should be flying an airplane? These air taxis they're not here yet but we've seen drawings and prototypes they look like a cross between a car and a kind of oversized toy drone and and something about them just screams Titanic submersible. All right we were wondering we were wondering when the tragedy and the timing would intersect for that's a joke and we just found out. You are. We're now doing jokes about that. Yeah and there will be uber and Lyft versions can you imagine how comforting will it be when you're up in the air in a new experimental flying craft and the pilot turns and says I only do this between my musician gigs right? Bill how did Aaron do in our quiz? Aaron you were perfect you got them all right congratulations. Congratulations Aaron. Right now panel time for you to answer some questions about this week's news. Paula authorities in Hong Kong have come up with a new way to crack down on those people who still smoke in public places where it's not allowed. They're asking non smokers to do what to those people? Hit them. It's not that aggressive it's more passive aggressive. Oh roll their eyes. Exactly right. No. Yes. Or specifically. I was kidding. I know you were but the official instruction is if you happen you're out there in Hong Kong and you happen to see somebody smoking in a non-smoking area it's all non-smoking in public you stare at them disapprovingly. So an eye roll would be perfectly acceptable right? Wow. Yeah that's the plan give these people a mean look if that doesn't work you can ostentatiously pretend to wave the smoke away for your face and if that doesn't work mime emphaseema. This is such an Asian mom way of communicating. It really is. Well supposedly like with the wildfire smoke that's like smoking like a pack of cigarettes a day so that's why you can find me on my street in Portland just staring glumly in the direction of Canada. Coming up we keep up with the Kardashians in our bluff the listener game call one triple eight wait wait to play we'll be back in a minute with more wait wait don't tell me from NPR. From NPR and WBEZ Chicago this is wait wait don't tell me the NPR News Quiz. I'm Bill Curtis we are playing this week with Paula Poundstone, Helen Hong and Luke Burbank and here again is your host at the Arlene Schnitzer concert hall in Portland Oregon Peter Segel. Thank you Bill. Thanks so much right now. It's time for the wait wait don't tell me bluff the listener game call one triple eight wait wait to play our game in the air. Hi you are on wait wait don't tell me. Hello hello my name is Jacob Meyer and I hail from Lancaster slash Hallock Minnesota. Oh Lancaster Minnesota now I have spent some time in my life in Minnesota but I'm not quite sure where that is where is it? Well if you know where Minneapolis-St. Paul is it's nowhere near there. The classic Minnesota Deke right there. Well welcome to our show Jacob you're gonna play the game in which you must try to tell truth from fiction. Bill what is Jacob's topic? Kim Kardashian saved my life. Well Kim Kardashian best known for her important work keeping up with herself I believe but she is as it turns out so much more than just a reality TV star. This week we heard about Kim actually saving someone's life in an interesting way. Our panelists are gonna tell you about it pick the one who's telling the truth and you will win our prize the weight waiter of your choice on your voicemail. Are you ready to play? Let's do this. Alright first let's hear from Luke Burbank. Becca Reardon was pretty sure she'd gone to heaven as she explained to the LA Times last week when she opened her eyes all she saw was white light and the face of Kim Kardashian looking down on her beatifically. But it wasn't heaven it was actually the very sticky very beer soaked floor of the Saddle Ranch bar on Sunset Boulevard in Los Angeles. Reardon was at her bachelorette party and was trying to ride the mechanical bull despite her cries of we got this girlies. She did not in fact got this and was promptly thrown off the machine. The problem was that one of the tiny plastic pieces of male anatomy from her hilarious novelty necklace broke off and lodged itself deep in her throat. Fortunately this was all unfolding mere feet from where Kim Kardashian herself was filming a scene for her reality show and just as things were looking bleak for our bachelorette a crazed fan started sprinting towards Kardashian. The fan collided with Reardon knocking her unconscious but not before jarring the small penis shaped item loose sending it flying across the bar. Incredibly this was not even the first time that week this had happened at the Saddle Ranch but it did give Reardon an amazing story about the time Kim Kardashian basically saved my life girlies. A crazed Kim Kardashian fan trying to reach her idol accidentally but successfully gives the Heimlich to a woman who was choking to death on an unmentionable item. Your next story of Kim to the rescue comes from Helen Hong. A lot of people claim that they just cannot live without their shapewear but one woman means that very much literally. Earlier this year Angelina Wiley was injured in a shooting in Kansas City and she recently posted a TikTok where she credits Kim Kardashian's skims shapewear for saving her life. It was so tight on me that it literally kept me from bleeding out. Miss Wiley says in the TikTok she ends the video by saying call it fate or Jesus but I'm gonna call it Kim. So here's a solution to the problem of everybody in America having a gun just make sure everybody has skims too. All right Kim Kardashian's skims both shapewear and a tourniquet. Your last story of KK saving the day day comes from Paula Poundstone. Paul Matlock reports that he had reached his wit's end. At dusk on a foggy raw San Francisco evening he climbed to the railing of the Golden Gate Bridge to throw it all away. I looked back and and I see Kim Kardashian step out of a black Benz. I thought this is getting weird. Matlock explains everything felt like slow and unreal. I heard her yell stop and I yelled back I'm not gonna stop. I don't know how to do anything. I'm a failure and I'm always gonna be a failure and I heard Kim Kardashian say you don't know how to do anything. I have no skills at all. Time magazine said that my ass is nothing but an empty promise. My company is worth 3.2 billion now. I climbed down and we took a selfie. It went viral. Kim Kardashian gave me hope. She saved my life. All right here are your choices. So Kim Kardashian directly or indirectly saved somebody's life recently. Was it from Luke Burbank how at an event where a woman was choking to death a fan rushing to meet Kim Kardashian accidentally jostled her and heimliched her saving her life. From Helen Hong a woman wearing Kim's Skims line of shapewear was protected from bleeding out after she was shot because it was so compressing. Or from Paula Poundstone how a guy who was going to end it all because he felt useless was told that's really not an obstacle by Kim Kardashian herself. Which of these is the real story of a life saved by our Kardashian? Let's go with Helen's story about the shapewear. Okay you're choosing Helen's story about the shapewear. Well this is great. To bring you the real story you were now going to hear from the real person whose life was saved. Under my dress I was wearing a Skims shape. So that was Angelina Wiley and that was her TikTok in which she describes how her life was saved because she was wearing Kim Kardashian's shapewear and as you can tell she's fine and her only problem is her shapewear has been ruined. Congratulations Jacob you did get it right. You earned a point for Helen. You've won our prize. The voice of your choice on your voicemail. Thank you for playing with us today. Thank you Portland. Thank you so much. Take care. And now the game where we introduce the great to the very trivial. It's called Not My Job. We are delighted to welcome to our stage here in Portland the 2013 NBA Rookie of the Year chosen by unanimous vote a seven-time NBA all-star. And the leading point scorer in the history of the Portland Trailblazers Damian Lillard. Welcome to Wait Wait Wait. You did it. I just wrote it down okay. I mean that's how that works. Whenever I get a chance to talk to someone like you an elite level athlete I'm always curious about how you got started and when you knew that you would be good at what you do. I heard in your case you fell in love with basketball by playing horse with your friends in Oakland. See these stories get twisted. That's how I know I'm getting old. I hear so many different versions but I started playing basketball because I actually faked sick one day from going to school. Really? And so did my older brother and my older cousin who's like my brother it was like all right everybody just stay home. So we outside in the front yard and they playing on our basket on our hoop and once I saw them I was like you know show me. So they started showing me crossovers how to shoot. They lowered the basket so I could dunk and I was like I automatically took interest in it. Really? But I was bad. First of all I don't think anybody believes you but I'm serious. Like I was bad. All right now. Is the moral of the story definitely fake sick kids of America? Fake sick. My stomach hurt. How old were you when this day happened? At this time I was like I would say around seven and then I became passionate about it. I would work on it by myself. I would go out there and shoot dribble. I would go to the park. Yeah. And that was when it started. Was there a moment when you like knew okay I am good at this. This is something I can do. Was your high school team was it like in the playground in Oakland? Where was it? I would say my sophomore year in college. I went to Weber State University so when I got there I was like people don't go to the NBA for a year. Yeah. I mean you were not you were not one of those kids who was like recruited by all the powerhouses. No. Not at all. So you're at Weber State. It's in Ogden, Utah. Ogden, Utah. We read that when you were at Weber State you had a trainer who's still with you. Still work with him right which is pretty cool. That's been for some years and we also read that every Sunday you would go with him to Famous Dave's barbecue. That's true. All right we got one story right. Right. So when you were when you were drafted number six I think in the first round by the Portland Trail Blazers did you immediately check if there was a Famous Dave's? I'm gonna tell you a funny story. Please. So I was known in college for being cheap. Really? Like I used coupons. I was great value everything. So Famous Dave's was like a nice restaurant that I knew. Right. You know I looked at that as like a nice establishment. Right. So when I got drafted here I looked for two restaurants. Wingstop. Wingstop and Famous Dave's. Right. And there's actually a Famous Dave's right down the street from the practice facility. You didn't know that. Did you coupon at Famous Dave's? I didn't. I could afford it. So it was a little bit different. What I'm noticing so far in the story is there's been no mention of horse outside of what Peter said. Right. I had this idea. They just tell me stuff. They say oh yeah man. Game got started playing horse but it's like nonsense. Not true. Okay. That's nonsense. Yeah okay. So you also have a remarkable career as a rapper. You had a kind of rap battle with Shaquille O'Neal. I did. Shaq Diesel? Yeah Shaq Diesel. So if you don't mind I gotta ask you about that. How do you get into a rap battle with Shaquille O'Neal? I say he started it. Okay. But I did a podcast in New York and they asked me who's the best athlete rapper of all time and I said me. He saw that interview. Yeah. And he took the fence. Of course. Well he's famously thin-skinned. Go on. So after that I was on Instagram one day and somebody sent me like a link and like he started dissing me like in a song. He made a whole song dissing me. Really? Yeah and I was like man like he really dissed me. So we went at it. Right. So you recorded a song and this is just one of the many verses from that. Loved you when you was in beast mode. Low-key thought you was a cheat code. Know that you shoot for the cheap hose. Shooting need work like your free throws. That's a diss. That's a diss. You have to diss. I'm sorry. I don't even know the man and I'm like that's low. That's hitting him where it hurts man. I'm worried because he's somewhat large. Where do things stand between you and Shaq after all this? We actually started like doing a song. We started trying to do music together. That's cool. We did a collaboration on a shoe and everything so it wasn't it wasn't personal like that. I just was like why not do some lyrical sparring? No. Why not? Well Damian Lillard it is an absolute thrill to talk to you and have you with us and we're gonna have you play a game and this time we are calling the game buzzer beaters meet buzzard eaters. So you're famous for buzzer beaters those last-minute shots we're gonna ask you three questions about eating like a buzzard that is the fine art of dining on roadkill. By the way we were talking. Who came up with this? Well I know. This great collective mom we were talking to Damian before the show and we said no matter how dumb you think this is going to be it will be dumber. All right we did not lie so if you answer two to three questions about this you will win our prize for a listener who will get as their prize the voice of anyone they may choose on their voicemail. Bill who is Damian Lillard playing for? Jasper Henley of Portland Oregon. Yeah okay. Ready? Okay here we go. First question every year roadkill enthusiasts gather in Marlinton West Virginia for the roadkill cooking festival. Now chefs compete in various categories at the festival and in the competitions they get points deducted for things like which of these? A gravel in the meat, B visible tire marks, or C if the autopsy reveals the animal died of old age. This would never happen at a famous Dave's. No. I'm gonna go with gravel in the meat. That's right yeah. That was easy. Choose slowly. I believe we refer to that in your field as a layup. All right second question. A Texas man came up with a roadkill recipe it's called stripped and shaved Cajun beaver tail and that recipe got him some special recognition what? A he became the commercial pitchman for Hormel chili. B he catered a dinner for the governor of Texas or C he got a spot competing on the TV show Master Chef. I'm gonna go with C. You're right yeah that's what happened. Sadly. He did not win. He did not make it past the third episode but all right last question. Roadkill is a problem everywhere people don't want it. Many places of course post deer crossing road signs an attempt to prevent roadkill but one North Dakota woman demanded they be removed from the highways in her state why? A a charging deer had once knocked her over while she was hiking and she wanted revenge. B as a self-described grammar nerd she did not like that the signs did not say deer's crossing or C as she said quote why are we encouraging deer to cross at the interstate? Unquote. Does any have anybody heard of this story is that why y'all so nervous? It is C. It is C yes. You heard it cause you heard of it. In her life she had hit three deers with her car herself she was sick of it and and apparently she thought it was because the deer read the signs deer crossing and said to themselves I guess we cross here guys let's go. Bill how did Damien Lillard do on our quiz? Perfect. Damien Lillard is a seven-time NBA all-star and the all-time leading scorer in Trailblazers history his fifth album Don Dalla will be out later this summer. Damien Lillard thank you so much for joining us on Wait Wait Don't Tell Me. In just a minute how to save the world while getting drunk that's in our listener limerick challenge call one triple eight wait wait to join us in the air we'll be back in a minute with more of Wait Wait Don't Tell Me from NPR. This message comes from NPR sponsor Grammarly Go. In the modern workplace you're expected to communicate more than ever before you need a communication assistant to do so without sacrificing quality input a prompt and Grammarly Go will generate suggestions that will help you fine-tune your writing to reflect your personal style it understands your unique context preferred voice and goals to quickly generate high quality writing in just a few clicks you'll be amazed at what you can do download at Grammarly.com slash go. Support for NPR in the following message comes from GoodRx laughter may be the best medicine but there's nothing funny about overpaying for prescriptions GoodRx compares prescription prices at local pharmacies and can save you up to 80% for simple smart savings on your prescriptions visit GoodRx.com slash wait GoodRx is not insurance but can be used instead of insurance Medicare and Medicaid in 2021 GoodRx users saved 81% on retail prescription prices. From NPR and WBEC Chicago this is Wait Wait Don't Tell Me the NPR News Quiz I'm Bill Curtis we are playing this week with Luke Burbank, Paula Poundstone and Helen Hong and here is your host at the Arlene Stitzer Concert Hall in Portland Oregon Peter Segal. Just a minute Bill buys a ticket for Oppenheimer in our listener limerick challenge if you'd like to play give us a call one triple eight wait wait that's one eight eight eight nine two four eight nine two four right no panel some more questions for you from the week's news Helen ABC has announced a new spin-off of The Bachelor and it has a big twist in this new version The Bachelor will be what old yes that's right the newest edition of The Bachelor called Golden Bachelor will star this hunky 71 year old silver fox with women vying for his affection who are all 65 or older yeah barely legal to still drive on the road I have you seen a picture of this guy he is straight up zaddy yes like I was like where did they find him what does that mean he's a hot he's a hot older gentleman I thought there was nothing that could make me want to watch that show less it's not even remotely interesting well don't you think that older people deserve to find love I think that older people deserve to find love absolutely I think I don't deserve to have to watch it I don't want to watch the younger people finding love either I just don't find it an interesting this version is gonna be really different because of the age of the contestants I mean for example in this version the fantasy sweets were really just be Werther's originals Luke stop worrying about your handwriting you will never have to sign anything ever again now that a judge in Canada has ruled that what counts as a binding agreement emojis yes specifically the thumbs up emoji no yes this is big news it comes right in the heels of the news that the eggplant emoji can make you pregnant so this case involved two farmers one had agreed to buy some crops from the other and the they agreed with the thumbs up emoji and then the guy tried to back out of the deal but the judge said no you sent a thumbs up emoji it's legally binding leaving many legal scholars exploding head emoji what I live with a two-year-old who grabs my phone and I'm gonna be buying so many crops exactly yeah let me tell you about emojis Luke ZZ ZZ ZZ emoji I even know what that means I could be strapped to a table with the radial armsaw coming up you know towards my in my cry that's an emoji like Batman and and and the villain could say to me use an emoji or or you know we're gonna cut you in half and I wouldn't do it you wouldn't do it just on principle I just hate emojis Paula I'm sending you a side eye right now no I mean this I think this is good the law has got to catch up with modern methods of communication for example justice Sotomayor stirring descent to the case striking down affirmative action was just a clip of Jim from the office turning to the camera Helen this week the Wall Street Journal addressed a specific problem in a state planning how some people have to make sure that what will be taken care of for many decades after their own death is it like a pet like a turtle it's in fact exactly that a tortoise yes tortoises I guess that a lot of people provide for their pets and their will but what do you do if your pet is going to live for 60 or 70 years after you die other than be jealous of them can you take it to the beach at the end of the Shawshank Redemption and just let it go into the water I mean they're tortoises they don't swim is that I'm not even being sarcastic is that true yeah tortoises are land animals you learn something every day yeah there you are they just kick around your kitchen and they move really by the way I just like to like sorry Luke Burbank what happened to that pet tortoise you had I don't want to talk about I need to run to the Willamette River coming up it's lightning fill in the blank but first it's the game where you have to listen for the rhyme if you'd like to play on air call or leave a message at one triple eight wait wait that's one eight eight eight nine two four eight nine two four you can catch us most weeks back at the Studio Baker Theatre in Chicago or come see us at the Greek Theatre in Los Angeles on September 28th also check out the wait wait stand-up tour it's headed to st. Paul Minnesota on August 18th in Kansas City on August 19th tickets and a full schedule of shows is at NPR presents dot org hi you're on wait wait don't tell me hi Peter this is Emily calling from Bend Oregon what do you do there in the most beautiful place in the world I am an event designer at a literary speaking agency a literary speaking agency in Bend Oregon that's cool is that like design do you say I'd like him to walk on stage wearing a gorgeous taffeta dress or something boy would I love to have that control well Emily here's something you can control because we are have invited you to play our limerick challenge that means that Bill Curtis right now is going to read you three news related limericks but as I'm sure you know he will not finish them you have to provide the last word of phrase do that two times out of three you will win our prize ready to go in honor of the Women's World Cup LFG there you go here is your first limerick when I run these old knees just start squawking I don't need to be tackling and blocking the ball I will chase at a leisurely pace because now I play soccer while walking walking yes walking soccer which is very popular in Great Britain is now coming here it's basically soccer but slower it's played on a smaller field it's much easier on your body basically it is soccer's pickleball meanwhile this will be an entire episode of the Golden Bachelor it really will be here is your next limerick raise your glass give our ale a big cheer our new drink makes a clear atmosphere the hops from our garden make negative carbon the climate is saved by our beer beer yes a new beer that's been developed in England is the first truly carbon negative beer it actually absorbs more carbon than it emits in its manufacturer so the more you drink the more you save the world oh thank God this is the idea it's made from what they call regenerative barley which is a kind of barley that's grown in a process that actually stores carbon also definitely the name of a bar here in Portland regenerative barley I would bet my life on it right wish they could do that with ringdings yeah what's really a man there to bring dings yeah generative ring dings all we needed to do like a president goes on the air and says Americans eat ringdings you must man I would be a hero yeah here is your last limerick my investors have changed their flat view my next pitch they'll invest in that too they have changed what they think when I showed them my ink they said yes because I flashed my tattoo tattoo yes a new study shows that crowdfunding campaigns like those on Kickstarter will attract more backers and raise more money if the pitch shows somebody with a tattoo right I guess if you're launching a new business investors just want to know you're willing to put up with hours of excruciating pain for something you will eventually deeply regret as a person with many regrettable tattoos I'd like to officially announce my Kickstarter regenerative barley yeah far I'm gonna open here in Slabtown Bill how did Emily do on our quiz Emily you got a perfect score and you live in Bend Oregon what else do you want Emily thank you so much for playing thank you so much take care now it is time for our final game lightning fill in the blank each of our players will have 60 seconds in which to answer as many fill in the blank questions as they can each correct answer is worth two points bill can you give us the scores Luke has two Paula has two Helen wait for it has four oh my god all right well Luke and Paula are tied for second so I'm gonna say Luke let's have you go first here we go fill in the blank after halting their grain export deal Russian missiles destroyed grain supplies in blank Ukraine yes on Thursday China rejected a US-led push for a joint committee to combat blank climate change right on Wednesday the Pentagon says it opened an inquiry into the soldier who was detained while crossing the border into blank North Korea right this week a bank robber in California was foiled after he told the teller he was there to rob the bank and she blanked said it's dame time no she told him to please have a seat and then made him wait until the cops came on Tuesday police in Las Vegas issued a search warrant seeking information in the 1996 murder of rapper blank to poxacore yes two years behind schedule electric car giant blank produced their first cyber truck Tesla yes this week a study of monkeys in Puerto Rico have shown that male monkeys lead happier and healthier lives if they are blank divorce no if they are gay or or I should say more accurately if they are bisexual the scientists found that male monkeys who mate with other males have better social networks and eventually had more offspring when they did get around to mating with the females it is an absolutely fascinating study and you can read about it in the new children's book by curious George bill how did Luke do on our quiz looks hot five right ten more points total to twelve and the lead all right all right Paula your turn has come you ready yeah here we go fill in the blank on Thursday it was announced that a billion dollar blank ticket was sold in California lottery yeah powerball on Thursday the Senate Judiciary Panel advanced an ethics bill for the blank Supreme Court right this week a judge temporarily blocked Iowa's six-week blank ban abortion right this week a rapper told the New York Times quote the adversity that I've had to face is probably more than any other rapper in history and that rapper was blank Kanye West no vanilla ice on Thursday Australia faced Ireland in the first game of the 2023 women's blank soccer yeah tournament all right I'm gonna give it to her it's the World Cup on Wednesday Wesleyan University announced it was ending so-called blank admissions the legacy yes legacy admissions great this week a cruise line apologized to passengers after one of their ships arrived at a port in the Faroe Islands just in time to see blank no idea just in time to see the annual whale slaughter this luxurious ambassador cruise ship set a cruise ship record for the most people throwing up not from norovirus and karaoke on the Lido deck bill how did Paula do on our quiz we have a tight game going Paula five right ten more points total of 12 tied with big Luke all right thank you here we go so how many then does Helen need to win well four to tie that means five to win Luke if you will distract Helen I will cut her microphone way ahead of you here we go Helen this is for the game fill in the blank on Tuesday Donald Trump said he is likely to be indicted in the federal investigation into blank January 6th yes on Monday the centrist no labels group said they would put forth a third party candidate for blank president yes this week a Florida woman who was arrested after throwing a burrito at a man's head defended herself by saying blank he didn't he didn't give her the guacamole no she defended herself by saying she was throwing it at a different man and missed on Monday blank set the record for the most number one albums by a female singer Taylor Swift who else on Sunday Carlos Alcaraz beat Novak Djokovic to win the men's single title at blank Wimbledon yes during her trip to China this week Treasury Secretary Janet Yellen surprised everyone when she ordered a dish made with blank at a local restaurant burrito that had been thrown at someone's head no a dish that had been made with hallucinogenic mushrooms whoa according to reports Yellen ate these psychedelic mushrooms while at a restaurant that served traditional Yunnan cuisine the restaurant posted on Twitter that the Treasury Secretary quote loved the mushrooms very much unquote and that after eating them she also said she loved everyone in the restaurant love the feeling of the carpet beneath her bare feet and if it's cool with everyone she's actually just gonna lie down for a little while bill did Helen do well enough to win it's a rare night she got four right eight more points total to 12 mean we have a three-way tie oh my god that is a very Portland I know because Portland Portland is very into equity right you know in just a minute we're gonna ask our panelists to predict after Barmanheimer what will be the next big blockbuster double feature but first let me tell you wait wait don't tell me is a production of NPR and WB easy Chicago in association with urgent haircut productions Doug Berman benevolent overlord Philip gotica Reza limericks our public address announcer is Paul Friedman our tour manager is Shayna Donald BJ leader man composed our theme our program is produced by Jennifer Mills miles norm boss and Lillian King special thanks to Blythe Roberson and Monica Hickey our starting point guard is Peter Gwynn Emma Choi is our vibe curator technical directions from Lorna White her CFO is Colin Miller a production manager is Robert Newhouse our senior producers Ian Chilag and the executive producer of wait wait don't tell me is Mike Danforth now panel what will be the next big double feature Helen Hong fast and furious 27 will combine with pitch perfect 18 leading to the music video we've all been waiting for Vin Diesel singing the cup song Luke Burbank how's this for a day at the movies Fugle Taylor you start with a thrilling biopic about Myron Fuglesang inventor of the Excel spreadsheet followed up by a riveting documentary about Marjorie Taylor green another blonde lady who lives in a completely made-up world and Paula Poundstone it'll be a double feature of backstage at Fox News and slinky the movie well a penny of that shows up in the theaters we're gonna ask you about it on my weight don't tell me thank you Bill Curtis thanks also to Luke Burbank Helen Hong and Paul a poundstone thanks to the staff and crew with the Arlene Schnitzer concert hall thanks everybody at Oregon Public Broadcasting thanks to our fabulous audience here in thanks to all of you for listening I am Peter Sagal we'll see you next week this is NPR"}, "podcast_summary": "This episode of \"Wait Wait Don't Tell Me\" features guest Damian Lillard, an NBA player for the Portland Trail Blazers, who talks about his basketball career and his rap battle with Shaquille O'Neal. The episode also includes news stories about roadkill cooking festivals, carbon-negative beer, and the legal recognition of emojis. The Lightning Fill in the Blank game shows that Helen Hong, Luke Burbank, and Paula Poundstone are tied with a score of 12 points each. The show ends with the panelists making humorous predictions for the next big blockbuster double feature.", "podcast_guest": "Damian Lamonte Ollie Lillard Sr. (born July 15, 1990) is an American professional basketball player for the Portland Trail Blazers of the National Basketball Association (NBA). He played college basketball for the Weber State Wildcats and earned third-team All-American honors in 2012. After being selected by Portland with the sixth overall pick in the 2012 NBA draft, Lillard was unanimously voted the NBA Rookie of the Year. Nicknamed Dame Time for his history of making big shots in the clutch, he has received seven NBA All-Star and seven All-NBA Team selections, the only player in Trail Blazers franchise history to do so. In October 2021, Lillard was honored as one of the league's greatest players of all time by being named to the NBA 75th Anniversary Team. He also won a gold medal on the 2020 U.S. Olympic team in Tokyo.\nUsing the stage name Dame D.O.L.L.A., Lillard has enjoyed moderate success as a rapper. His first studio album, The Letter O (2016), charted on the Billboard 200, while his second and third albums, Confirmed (2017) and Big D.O.L.L.A. (2019), placed on the indie charts. In 2021, he released a fourth album, Different On Levels The Lord Allowed.", "podcast_highlights": "In this episode of \"Wait Wait Don't Tell Me,\" the panel discusses various topics, including the release of two new movies, the extreme heat wave in the US, the rollout of air taxis, and a new version of \"The Bachelor\" for older adults. They also interview Damian Lillard, a professional basketball player, and discuss his career and interests. Additionally, they play games with callers, including \"Bluff the Listener\" and \"Lightning Fill in the Blank.\" Overall, the episode provides a humorous take on current events and pop culture."}