{"podcast_details": {"podcast_title": "Hello Isaac", "episode_title": "World-Renowned French Chef, Jacques Pépin", "episode_image": "https://www.omnycontent.com/d/programs/e73c998e-6e60-432f-8610-ae210140c5b1/81483b3c-7c53-453e-bbc0-b00d011fa9d8/image.jpg?t=1685736608&size=Large", "episode_transcript": " Pleasure, intimacy, self-love. Real reasons to focus on your sexual health and wellness. This includes HIV prevention. The Ebony Study is for Black women who have decided to receive injectable PrEP. Injectable PrEP is approved by the FDA and is an effective method for preventing HIV from sex. Learn more about how the Ebony Study seeks to support Black women in creating peace of mind around their sexual health at EbonyStudyInfo.com. That's E-B-O-N-I-StudyInfo.com. A new podcast from the creators of Up and Vanished. Louisville police are searching for a missing 24-year-old woman. When I read about Alana Chen's disappearance, I couldn't look away. A shy girl from Boulder who wanted to be a nun since she was a teenager. But she kept a secret, one that was slowly tearing her apart. From Tenderfoot TV comes a new podcast about the price we pay to belong, and the systems that pay no price at all. This is Dear Alana. Listen for free on the iHeartRadio app or Apple podcasts. For an exclusive binge of the whole season, subscribe to TenderfootPlus at tenderfootplus.com. What is your last meal? Tell me what your last meal is. Well, from caviar to hot dog, from ham and egg to a pigeon to a squab, everything that I like. I would like it in front of me with all kinds of things and a lot of friends around, and I would eat until I fall dead. This is Hello Isaac, my podcast about the idea of success and how failure affects it. I'm Isaac Mizrahi, and in this episode, I talk to world renowned French chef, cookbook author and TV personality Jacques Pepin. Hello, Isaac. This is Jacques. I'm so glad to be with you again and to learn something about cooking. I need to learn something about cooking from you. I always do. See you soon, very soon, I hope. And cook well, eat well, enjoy life. I don't know where I first met Jacques Pepin. It was definitely on a food demonstration somewhere, like on my show or Martha Stewart's show or somewhere, and we automatically liked each other a whole lot. And one thing that Jacques does, I think to everybody he meets, which is why everybody adores him so much and learn so much from him, is that he kind of puts everybody on the same level as him. Like all of a sudden, you are a peer with this person who just knows every damn thing, like trillions and trillions more than you know. But somehow he treats you like a peer. It's sort of the way my mother, bless her, used to operate with my friends. I remember my friends really loved her so much because she would speak to them like adults. She never spoke down to them. They were always on the same level as my mother. She would tell them jokes and they would have this rapport. It's the same with Jacques. You know, when I met him, we not only cooked together, we sang. I had Ben with me and Ben played the piano when we sang together. He got to know my dog, my dog, Harry, who automatically loved him because he fed him scraps off the table. I remember we were cooking once together and there was garlic in the recipe and a lot of it and it had to be peeled. And so I showed him this thing where you snip off the little woody end of the garlic clove and you put all the garlic cloves together in a bowl, like two shallow metal mixing bowls and you shake them vigorously and then all the peels fall off. It's a miracle. And I showed that to him and I swear to you, it was like he was seeing God for the first time. That was like a garlic hack that I taught the great Jacques Pepin. And when that happened, I thought this is the greatest teacher in the world who is like learning from me, the greatest fool in the kitchen. That's what keeps Jacques Pepin so eternally young is this ability to learn from his students. So let's get into it. Jacques Pepin, how are you? It's great to see you. It's great to see you too. Is that your bedroom? Yes, this is my bedroom. This is your bedroom? Yes. Okay. That's your office. I just thought we would be very intimate today. Very intimate. And is that your pot rack behind you? This is my pot rack. Yes. The kitchen is my domain. I usually start interviews by asking my guests to surprise me, but in your case, I'm going to ask you to tell me what you ate today. I just had a whole bunch of cherries now. And before that, for lunch, I had a sandwich that Claudine did yesterday and she left. And she said, I have that sandwich tomorrow. I forget what was in it. I know there was prosciutto and tomato. Delicious, delicious, delicious. I'm going to talk for a minute with you about eating because I've never heard you speak too much about eating, darling. What was the greatest thing you ever ate in your entire life? There are many of those, but I mean, certainly for me, it always goes back to maybe the food my mother. I mean, those are kind of very visceral taste, the stuff that you eat when you have a child. So you can find that. I always talk about Proust and the affective memory in Proust. And the memory of the senses as opposed to the memory of the brain, that is the smell, the touch, the look, and especially the smell and so forth. So I can't be walking in the woods with my dog. I don't think about anything and I smell wild mushroom. And all of a sudden I'm seven years old with my father, my brother picking up wild mushrooms. So those tastes are very visceral. So if I taste the chicken that my mother used to do as a kid, you know, chicken with cream sauce and tarragon, right away I am seven years old and I remember those tastes. Yes. That's a great thing to love. Do you cook that often? Do you cook that particular dish that way that your mother cooked it? Occasionally, you know, when we go on that taste memory type of thing, including my daughter is here and she wants something for her grandmother. It's funny because for her, she had dishes that she liked the best done by her mother, by her wife. And she's done the other one by her grandmother, other one by me. It's quite different than the dish that I like. Since COVID, you know, I get a little bit dull with my routine. You know, I roast the fish or I roast the chicken. You know, it's a very simple menu and I cook the same things again and again. The things that you cook all the time, aside from the things we see on your website. Yes, absolutely. And especially when you get older, your metabolism change. And as a young chef, I tend to add and to add and to add to the place. Now I take away, take away, take away from the plate to be left with a couple of more essential things without too much embellishment on the plate anymore. So I would go back to what my wife used to call fridge soup. You know, I opened the fridge and the lettuce, which is wilted and a piece of carrot, two onions, a couple of black mushrooms, I do a soup with it. So fridge soup is, yes, very constant. You taught me another fantastic thing. Once we were deglazing something together and you said, oh, you know, you could use Chateau de Sinc, which means water basically. Right. Because usually you deglaze with wine. But you made that joke. And I thought that was a very good joke. Darling, you've always been such a good looking guy and such a slim guy with all that eating constantly. I hold my stomach thin. Well, now, of course, everybody wears the Spanx and we all do that. But how did you do that all these years? I'm basically a glutton. You know, I eat whatever you put in front of me. I am probably 10 pounds or 15 pounds of a weight, whatever. But I've never been on a diet in my life and my wife was even better than that. I mean, she ate from the bacon and all the fat and all that too. And she never went above 120 pounds. I mean, you know, she was always a very thin, so she was very lucky. I'm not, I could put on weight, but I've never really put on that much weight. Did you have to watch it all those years? Did you have to stop yourself from eating? Not really. When I felt that I eat a bit less, but I never went on that specific diet of not eating this or that or two. I never really stopped myself from eating bread and butter. Right. But you know what? When I discovered that I was a good cook, which was about, I don't know, 20 years ago or something, I cooked constantly. Like every meal was something, you know, every day was three meals and we marketed constantly. Are you at the market a lot? Oh yeah. I love the market. I already love the market. I do it less now, but especially the market in season when I go to the farm markets and look at things and buy. But conventionally, because of what I do on television and on show that I do, I use conventional supermarket, you know, stop and shop, whatever the best that I can find there, but still so that people can relate to what I'm buying there. Do you trust others to do your marketing for you or do you prefer to pick out your chickens? Well, I trust everybody, but I like to look at it myself, you know, test it. And very often I'll go to the market and say I'm going to, I don't know, roast a chicken tonight and I go there and they have duck for sale, two for one. I'm going to sell my menu. Oh, right. You're such a cheapskate. I forgot about that, Jack. No question. But not exactly a cheapskate. I think it's about being, a good word is parsimonious or, you know, you would execute to the nth, nth, nth degree. That's what you taught us was that you don't waste anything. You don't overdo, you don't underdo, you do exactly what is necessary. But you know, I used to be able to like make stock and use it, you know, and freeze it and use it because I was cooking more, you know, but when you cook less or when you make the stock and then you throw it away six months later, because even in the freezer, it goes bad. Are you cooking now for a bunch of people or are you just cooking for yourself? I never throw stock away. My God, even if it's a year old. Oh, really? Wow, Jack. No, I do, well, cooking, but like Friday, we're cooking for 22 people. I'm cooking. So with my son-in-law and Michel Nichon is going to give me a hand and my daughter, we got to play boule, you know, the batchy type of French pétanque, you know. Yes, I love boule. We have 22 people for dinner. So we have big menus. What are you cooking? Is it a big clam bake? Is that the clam bake thing that you do in Connecticut? Oh, no, no, no, the, no, the clambake is done already. No, no, this one is really fancy foie gras caviar. And then we have a salmon in puff paste. And then I have a shoulder of veal roasted with a gratin of cauliflowers. We have a salad with pear too. And then I'm doing some, some little swan with shoe paste to look like swan, you know, for dessert. It's a fancy dinner for people who support the foundation. I'm very fortunate to come and have dinner and play boule with me. So getting back to this parsimonious thing about, you know, a good chef is always washing dishes and, you know, collecting bones and putting them in the freezer. I remember this story from your incredible memoir. It's called The Apprentice, right? Yeah. And I remember the story about maybe it was when you were on your honeymoon or you were on a trip with your wife and there was an attack of snails. So you took the snails and you cooked escargot. And I thought to myself, you know, you had that big accident with a, was it a stag or something? And I thought that I'm sure someone came and got the stag. And when you recovered, you cooked the stag, right? Because you can't let the stag. Right. So do you cook for a lot of people right now? More than 22 people, but on a regular basis? Not really. Although Friday night were eight people at my table, but very often I'm by myself or two people too. So I don't, but usually my daughter, I get crazy because when I go to her house, I open the refrigerator, things are falling out. I don't know what's in the back. I mean, you can open my refrigerator, you have three things. And she said, your refrigerator is already empty. Yes. I don't like to have things. I use things in my refrigerator or in the freezer or whatever, but I am very thrifty, you know, in the kitchen. And I learned that probably from my mother. I mean, during the war, when I was a kid, you know, we didn't really have much to eat. And my mother could make things with nothing from sugar that she made with root beets, that she made a syrup, because it's sugar to other things. My mother was a great cook and I learned I was supposed to be very miserly in the kitchen because of her. And there is a style of cooking. I am very much more impressed if I work with a chef who cooks something to end up some leftover. He does this with it and do that for someone who does a beautiful plate, but there is leftover for five people put all over the plate. That doesn't impress me. No. Now me either. I with you on that. All right. So I always wanted to know from your perspective, what was the highlight of your career? I think I have many, many highlights in my career, but I'm very existentialist this way. You know, I always thought that in life you do this decision, which don't seem to be that much at the time and change all your life. And it projects you in different directions. For example, I decided to come to America in 1959 and I came for a year. I said I'd come for a year and go back. I had a great job in France. My parents had a restaurant too. And I'm here 60 years later. So you do those decisions which throw you in a different direction. And from then you join and do another. You know, I worked for Howard Johnson for 10 years and I was offered a job at the White House in 1960 for Kennedy. And I went to Howard Johnson. But why? Well, to start with at that time the cook was at the bottom of the social scale. And I had no idea of the potential for publicity because it really did not exist. When I was with the president in France, I'd never been once on the newspaper or magazine too. No one would ever call you a kudo in the dining room. Did not exist at the time. So I went to Howard Johnson, 10 years. It changed my life. When I left Howard Johnson, 1960, 1970, I opened a restaurant on Fifth Avenue called La Potagerie, mass production. Then I opened the World Trade Center with Joe Baum. We served 40,000 people a day. Then I was a consultant at the Russian Tearoom. And I would never have been able to do that as a French chef. And even my accident, you mentioned my accident. I left the kitchen at that point. I mean, the work behind the stove itself. And I started for 10 years at the colony in the New York Times. I started moving more in that direction of writing books and so forth. So, you know, things that happened to you determine what you're going to do. Nothing is planned. That's incredible. There wasn't a grand scheme. Oh, no, no, no, there was never a grand scheme. And then, you know, I came here and I said, well, I left school when I was 13 years old to go into apprenticeship. So I said, I better learn English properly, which didn't really happen, you see. But anyway, people say, oh, the best school is Columbia University, which of course I'd never heard of. Took the subway, went there. Three weeks after I was here, I was enrolled at Columbia as an English for foreign student. So that was 1959. And I stayed at Columbia until 1973 because one thing led to another to another. So life is full of those type of surprises. And I always think that you should try to appreciate that, try to realize that what happened to you, you can always do something with it. Move forward. That's great advice. That's a really great advice. Yeah, you have to be positive in life. So back to school for a minute, because I know that mostly you learned to cook from the family restaurant. There was a small restaurant, as I remember reading. A little bit when I was a kid, yes, right. They put you to work. You had to start very, very young because of the war, etc. Right. And so you knew a great deal about cooking, or did you go to Cordon Bleu or did you go to school? Yeah, the school did not exist at the time. School for cooking. So when I finished in France, you had to go to school until the end of primary school, which is 14 years old. So at 13, I took all of the final exams. And at 13, I left home to go into apprenticeship in a big hotel in Bourg-en-Bresse, the town where I was born, to do a formal three years apprenticeship behind the stove. So I started there from 13, and then I went on to Paris and work at different places. So you learned practically on your feet in kitchens. Oh, absolutely. I mean, you start in the kitchen and do a lot of cleaning. And at that time, apprentices were able to take care of the stove, so to not only light up the stove with paper and wood and coal, to keep that stove really hot so that at 12 o'clock, everything is red. Otherwise, you screw up the whole dining room and kitchen if your stove is not exactly right. So the working of the stove was already a big deal. And then you do that for a year, year and a half, cleaning up parsley and eviscerating fish and killing chicken and plucking chicken and all that type of stuff. Until that day, the chef tells you, you started the stove tomorrow. No kidding. So no one ever taught me anything. So I come to the stove and I knew how to do it. So the learning was by osmosis, in a different way than now. There was no recipe, nothing written. You say, do this, do that. And the chef tell you to do this. If you say why, he would have said, because I just told you. And by the way, I remember when I was younger, right, visiting friends of mine who were starting in kitchens or visiting my famous friends who were chefs and going into these kitchen cultures. And I don't know how anybody made it through any of those kitchens, really. So many of them, there were these horrible bullies. And I can only imagine like, take that back 40 years, and talking about how you grew up. And it's a completely different. Now you get, if you say something this way out of line, you get canceled, you know? Oh, absolutely. What was it like, how brutal those kitchens were, even in the 1980s and 90s, you know, and the early 2000s. Talk about that for a minute, if you please. Well, I was in apprenticeship in 1949. So anyway, yes. But I have to say the chef was very fair. That doesn't mean he didn't kick you in the rear end occasionally and yelled at you too. That was the way it was, you know. Now, and as you say, the wet dress would go by. We saw the wet dress and talked to her. Now, you wouldn't do that now, but it was part of the culture. Yes. Yes. So now back to this idea of learning, because I think of you as a teacher, but somehow you had to learn. Did you read Escoffier or Carême or something? Did you read a lot? No reading at all. I never read a cookbook before I came to America. So because in France, you learn and the chef said, do that. And you do and you repeat, you repeat, you repeat. At that time, you work in restaurants, you taste the food, and you strive not only to adjust, but to duplicate that, you know, to try the question of feeling part of it. You were not there to innovate or change the recipe or whatever. No, you were there to conform to exactly that recipe. And at the Plaza Athene in Paris, we were 48 chefs in the kitchen. For example, the lobster soufflé was very famous. I think it still is. Well, 48 of us could have done that lobster soufflé, you would never have known which have done it. So the idea at that point was to conform to do this, you know, differently than now, now where the chef will tell you, make sure that they know I'm the one who did that. I'm signing it and all that too. Yeah, that didn't exist at the time. So it worked a different way. Wow. If you had to think of like the most obvious way that industry, the restaurant industry, or the food industry, for that matter, has changed in the 40 years or the 50 years that you're talking about, would you say that's the biggest change? Or is there something else that comes to mind? Yeah, no, probably the biggest change also starting with Nouvelle Cuisine, where the chef started putting things on the plate and arranging them on the plate. I mean, my mother had a restaurant in France, there was 12 restaurants I count in my family in France, 12 of them run by women. I was the first male in that business. So my aunt, my cousin, my sister-in-law, everyone. So but my mother even on a small restaurant, it was five francs, one dollar, five francs when I came to America, her whole meal, first course, main course, dessert, a caraf of wine, tax tip, everything included was one dollar. At that point, she saw fish like mackerel or whiting, you know, inexpensive fish, she would always serve it on a platter, never on a plate. Even in a restaurant like this. So the service on a plate was another world altogether. And that service on the plate, which started with Nouvelle Cuisine in the 70s, kind of in a sense destroyed the dining room. Because all of a sudden, the way it was just people who pick up that platter, bring it there, there was no more work in the dining room, which for years for me, the whole thing happened in the dining room, the carving, the thing. So I miss that a little bit too. I mean, the work of the dining room was much more important. And in France, when I was in Paris, if you wanted a new job, you didn't go to other chefs, you go to all the Metrodis and all that were all in charge of an hiring chef and all that they were the one, not the chef. Now it's totally changed. Right. And I remember this idea, if you go someplace and you order some kind of chicken plate, they take it and bring it to the table and serve it to you. It's not all arranged, you know, right. Hey, it's Mario Lopez here. I want to talk to you about the awesome advanced tech now available in Toyota's SUV lineup. Like the adventurous RAV4, this already versatile daily driver gets better every release. And this is no exception. With available wireless charging, it keeps you connected and new safety features like panoramic view monitoring give you a 360 degree view around your vehicle. How cool is that? Or check out a stylish Venza with features like a panoramic sunroof, heated and ventilated front seats. This ride is more comfortable than ever before. And it's available in hybrid and all wheel drive models or combine efficiency in space and a Highlander available as a hybrid, giving it more power than ever before while still fitting your friends, family and all your stuff inside. And every new Toyota comes with Toyota Care, a no cost maintenance plan. So do not wait, head down to your local dealer for a test drive and visit biotoyota.com for more Toyota Let's Go Places. A new podcast from the creators of Up and Vanished. Lewisville police are searching for a missing 24 year old woman. When I read about Alana Chen's disappearance, I couldn't look away. A shy girl from Boulder who wanted to be a nun since she was a teenager. So Alana was like sneaking out to go to church. But she kept a secret, one that was slowly tearing her apart. I didn't know she was attracted to girls. Nope, she didn't tell me. Yes, the mother says her daughter first opened up to a priest at her church when she was just 14 years old. However, the church denies any conversion therapy was done. She didn't tell me she told him. She confessed to him. From Tenderfoot TV comes a new podcast about the price we pay to belong and the systems that pay no price at all. This is Dear Alana. Listen for free on the iHeart radio app or Apple podcasts. For an exclusive binge of the whole season, subscribe to Tenderfoot Plus at tenderfootplus.com. to different artists and the stars of your favorite movies and shows and getting the full story. We'll be talking about their favorite projects, their journeys to success, and all the things they've learned along the way. And of course, as the title suggests, I'll also be asking all of my guests to tell me at least one thing that they've never said before. So join me for a conversation you won't want to miss. Subscribe now and listen to I've Never Said This Before with Tommy D'Addario on the iHeart radio app, Apple podcasts, or wherever you get your podcasts. Something you started talking about a little bit earlier, which I get a little crazy about, you know, some of these cookbooks where they say you have to use this Jerusalem artichoke from this farm in Northern California. And you think, well, there's half of these things in this book I can't make, you know, and then there are some other chefs who go here's, you know, like some frozen shrimp, and I'll give you a very, very good idea to do with frozen shrimp. Where do you stand in all of that? What do you like and dislike in all of that? Well, I feel for me that we're still a mashed potato maker. I mean, we're not genius. So I mean, some people take it too seriously. But if you buy proper ingredients, good food, you do food. But if I do a recipe with that, I know that the people who are going to do that recipe cannot be the same. Because even for me, if I do the same recipe that is my recipe, it's never the same. And that's what happened in a professional kitchen. People don't realize that you do a chicken saute with the mushroom. Okay. The same night, I have eight orders for that same dish. If someone was behind me to write down exactly what I did for each of those, they all taste exactly the same when I said it. But if someone were behind me to take note exactly what I do, at that time, it would have been different. Why? Because maybe the chicken they gave me was thinner, thicker, my stove was warmer. So, you know, it's a question of adjust. You start cooking, you adjust, put a tablespoon of that, adjust taste to it. If it comes out good, you're likely to do it again. So a second, third time, but the three, fourth time, I think I'll put a bit more tomato, I'll do that. And a year later, it is your recipe, you massage it enough, so it becomes yours. That type of progress is what I think should go on in the recipe. Right. You know, like you're talking about specific recipes, and I think there are many people who are very good at following recipes and even creating recipes and creating beautiful food. I'll tell you, for me, the hardest thing is doing a meal by myself. When it's my husband and me, and it's just us two, darling, you cannot believe what I am capable of creating in the kitchen, a whole meal and dessert and everything. But like if you're creating a meal for four people, like that's what? That's an entree, that's an appetizer, that's a side dish or maybe two side dishes, dessert. That's a lot. Like what's the best advice you can give me? Well, you're absolutely right there. And my advice is going to be different whether Claudine is giving me a hand or I'm by myself, whether it's winter, summer, what can I get at the market, to all of that come into consideration. When I have decided on the meal, however, that it's a question of breaking it down. What can I do the day before? What can I do ahead? What can I do there? So, you know, it's totally different that I'm going to do a demonstration in front of a camera, I do the dish. If I have to do it within the context of a menu, I don't do it the same way because I do half of it, I put it on the side and finish it up later. Well, this is cooking, I'll do this. Well, this is cooking, I'll do that. So the making of a meal is not like the making of a dish where you go from the beginning, you go to the end. Very often the making of a meal is made of tiny part of each of the recipe individually that you do put on the side. You open your wine, you leave it on the side, you clean up your salad, you drain it, you put it on the side, you season it later, you do this. And this is where being a professional is good because you break down the recipe in your head. And you know, all of the different aspects of the recipe to do the finishing here or not the finishing there. So, you know, the making of a good meal like that presupposes a lot of knowledge of cooking, because you break down all of those things and so forth. And I think also practice. Yeah, practice, of course. You know, I remember this very sly friend of mine who I used to cook with a lot. I adore her, her name is Susan, and she's a big fan of yours. One of these days she's going to meet you and she's going to start screaming. Oh, my God. And she gave me a recipe of yours for a standing roast. And she neglected to tell me to bring it to room temperature before I cooked it, right? And it was so undercooked. And I was so freaked out. So that's a mistake that you make, right? And the more you practice things, the more you do. It's like, oh, you put the pasta in. Now, don't forget, you better set a timer or leave the lid off or something. You know, you get better and better at the little tiny thoughts that you wouldn't necessarily think to write down in a recipe for one thing, right? No, it's true. All the feeling. I know people who write books about the chemistry of food and all that. They can tell you exactly what you're in on the sauce. You bring it to that temperature, break down. They tell you everything which is wrong when you do it. And you go eat at their house, the food is unedible. And then you have the grandmother at the corner of the street in Italy or in France who does the greatest food you ever had. Just as the most divine food. She never measured. She never measured, never had anything. So, you know, it's totally different way of thinking about food. Yes. And by the way, what I love is if you could see behind Jackie has about three million pans and they're not even pots, they're pans. I don't use the copper too much. It's too heavy. I know me too. But darling, I like you have a lot of things. I like things. I like gadgets because sometimes they just make things easier. You know, and after having this tiniest kitchen in the world for the first seven years of my existence and as an adult, you go, you know what, if you can, if you have the space for a food processor, isn't it better to have a food processor? What is your favorite kitchen implement? Why do you absolutely just go, I can't live without this besides a knife? My hands. That's a good one. Yeah. I think that pots are attractive, visually pleasing. You have them outside. You grab them and sort of go looking on the drawer, you know, where is my pot? My hand is good. I have a good board, a solid board, it doesn't bounce back. A good knife, but I call a good knife is a sharp one and solid and, you know, and a good pot. That's all you need. Darling, how did you live without a food processor? How did you live without a hand mixer? You know, the mixer. You're right there. I remember at the Plaza de la Tene in Paris, we had that big mortar in granite like this. We used to have 10 pounds of fish with a mushroom, a wood mushroom, enormous pounding that, pounding that. And then after that, through a screen with a wood mushroom, through a screen to make the puree. Then we put that on ice. Then tablespoon by tablespoon, we start working the cream in it and so forth. You've put it on and you just whizz it through. And you know what? When I read those old recipes, there's always about putting it through a sieve. And I never understood what the hell that was about. But I guess that's to make something very, very finely, finely, finely, puree. Finally, there is always some fiber in the fish that has to be removed. So certainly, yes, it's totally different now with the type of equipment. And I know that if Escoffier had been here when the food processor is coming, he would have been very happy. Right, exactly. What's very overrated, do you think, in the kitchen? Is there something that you don't need that you tell people not to buy? There are, for example, you see the pot that I have on the wall there. And those are real copper, thick copper. And there is a lot of fake one. You'll have a fake pot which is in the stainless steel or two. And they cover it with a bit of copper. And you pay a fortune for it and everything burns in it. It doesn't have the conductivity of good copper. So often there is those things that you buy. Knife is the same thing. You buy some knife and then you can never sharpen them. Or a board if you buy a cutting board, which is too thin and everything bounced back on top of it. So it's a question of a couple of pieces of equipment, but good equipment. Right. Jacques, I think that you were the first person I ever saw work with a food processor, a Cuisinart food processor. The first time that I did it was Carl Sontimer. Do you remember Carl Sontimer? He was the president of Cuisinart. Well, he's the one who created Cuisinart. Yes, I do. Yes. He was American, but he went to school in France when he was a kid anyway. Went back to France and saw that machine, which was called Magimix. Magimix. And he bought it and created the name Cuisinart. And he came back and I did at Gimbal. Gimbal in New York was the first one he asked me to do a demonstration with that machine. So, wow, a great machine. I mean, it was fantastic. It's a great thing. Absolutely. Absolutely. Hey, it's Mario Lopez here and I want to talk to you about the awesome advanced tech now available in Toyota's SUV lineup. Like the adventurous RAV4, this already versatile daily driver gets better every release. And this is no exception. With available wireless charging, it keeps you connected and new safety features like panoramic view monitoring give you a 360 degree view around your vehicle. How cool is that? Or check out a stylish Venza with features like a panoramic sunroof, heated and ventilated front seats. This ride is more comfortable than ever before and it's available in hybrid and all wheel drive models or combine efficiency in space and a Highlander available as a hybrid, giving it more power than ever before while still fitting your friends, family and all your stuff inside. And every new Toyota comes with Toyota Care, a no cost maintenance plan. So do not wait. Head down to your local dealer for a test drive and visit biotoyota.com for more Toyota Let's Go Places. A new podcast from the creators of Up and Vanished. Louisville police are searching for a missing 24 year old woman. When I read about Alana Chen's disappearance, I couldn't look away. A shy girl from Boulder who wanted to be a nun since she was a teenager. So Alana was like sneaking out to go to church. But she kept a secret, one that was slowly tearing her apart. I didn't know she was attracted to girls. Nope, she didn't tell me. Yes, the mother says her daughter first opened up to a priest at her church when she was just 14 years old. However, the church denies any conversion therapy was done. She didn't tell me. She told him. She confessed to him. From Tenderfoot TV comes a new podcast about the price we pay to belong and the systems that pay no price at all. This is Dear Alana. Listen for free on the iHeart radio app or Apple podcasts. For an exclusive binge of the whole season, subscribe to Tenderfoot Plus at tenderfootplus.com. On my new show, I've never said this before. I'll be talking to different artists and the stars of your favorite movies and shows and getting the full story. We'll be talking about their favorite projects, their journeys to success, and all the things they've learned along the way. And of course, as the title suggests, I'll also be asking all of my guests to tell me at least one thing that they've never said before. So join me for a conversation you won't want to miss. Subscribe now and listen to I've Never Said This Before with Tommy D'Addario on the iHeart radio app, Apple podcasts, or wherever you get your podcasts. Now, Jacques, I want to talk to you about failure, about something that you failed at, that you came back from and that you learned something from, like something you did or did not do and you regret or something, but then you moved on and it taught you a great lesson. Are you talking about in a recipe? Let's talk about in your life because I think that's more important. And you spoke about your accident, which of course is a major setback, but is there something that you regret? I don't frankly regret much. I mean, when I was at Columbia until 1972, in 1973, I proposed a doctoral dissertation on the history of food, context, civilization, literature. And at that time, they thought it was very superfluous, I mean, very very important. And they said, you cannot do that. So I left. And but yeah, maybe if I had to go back because I had basically finished my PhD except my thesis, I probably would have finished it, but not that it would have made any difference in my life. It's just personal satisfaction. But otherwise, in the cooking itself, you do dishes, which sometimes work better than some other time. But for a professional, I mean, cooking is the art of recovery, you know, the art of compensation, or the art of adjustment. I mean, you do a biscuit, you know, to do a biscuit roulette or a roulette in the oven, you leave it three, four minutes to munch or you didn't beat the eggs white properly. And the thing is dry. So you don't throw it out, can roll through it, you cut it into strip, you put the thing in between, you do a cake in a different way, but you use it. So there is those types of recovery. Except one time I was in the, oh, it was the early 70s, the Go Natural tour I did with a whole bunch of people who were dancing. And I had the food segment of like 50 minutes and we had like three, four, 5,000 people. And we were in Sacramento. So I get there, I get into the kitchen and they calculate the thing was two hours, they calculate for me to come at a certain moment and finish. So I did a cheese souffle. So when I went for my turn, I went on in the morning, I opened the stove, I looked, the oven is working, that's working. And so I did my demonstration in 15, 20 minutes, whatever I did. And I had to leave the stage for 45 minutes, come back at the end with the run, get my souffle out of the oven. But I had no way of checking in between. But when I finished cooking, put it into the oven, I put my hand, the oven was working. I didn't try the oven, it went on self cleaning, self cleaning like 700 degrees. 700 degrees. Oh God. You've never seen a souffle half burned, half black. I had a standard ovation. People were so happy. Wow. The recovery. I have to tell you, no recovery. You can't recover. That is divine, that story. But I have to tell you, I use your cheese souffle recipe or your souffle recipe as the basis. I'll tell you what, Jacques, I think that's your particular genius is not specific recipes, but those books that you did that La Method and La Technique, darling, I have originals, I have first copies. I mean, I bought them not in the time. I bought them from rare booksellers, darling. But just so you know, I'm telling you like that souffle recipe, you could adapt it to, and I think that's your genius is this, that you give a good sort of pâte sucrée recipe, a good souffle recipe, a good roasted fish, a good, you know, and so all of those things you can add. I think that's your genius. You make them your own. You make them your own. And I think that those books that you did were a kind of a desperate pulling forward. You pulled us into by showing us pictures, many, many, many pictures. If you don't know what those books are, they're almost like early kind of step by step video, but before video. And so you did that. And I tell you, I learned the most cooking from those books. Yeah, it's interesting because I did La Technique in 75, but I don't cook the same way that I cook in 75. I mean, 50 years later, but the way you sharpen a knife, peel an asparagus, peel an onion or portion an egg is the same. So those techniques kind of remain the same. You can make a radish swan in exactly the same way. I do love a radish swan. You know, it's hard to talk to you about your life without kind of defaulting to food and defaulting to cooking. But what if you had not been such an incredible kind of close part of this community of restaurateurs, you know, would you have done something else? I guess so. But you know, again, I'm 88 years old. So I was in the kitchen when I was seven, eight years old. So 80 years ago. At that time, we didn't have television. Of course, we didn't have the radio. We didn't have the telephone. We didn't have any of this. So my father was a cabinet maker by trade. My mother was a cook. So in life, my choice was cabinet maker or cook. I never thought that I could be, you know, a lawyer or doctor. This was so far from our life. So I never even thought about that. I follow with my mother and I love in the kitchen with my mother. So I went this way. I move in that direction and I was happy with it. So I never really changed. Okay. But so do you go to France a lot? Not really. You know, I am culinary director of a cruise line, Oceania Cruise Line. So I do a couple of cruise every year. And in September, I know we'll be in Marseille, Monte Carlo, and then Barcelona and all the Mediterranean islands. And Claudine is a godmother, one of the ships. So we do that. I do that with her too. But otherwise, you know, in France, I have a couple of cousins, nieces left, but basically no one else. So I haven't really gone to France and spend much time there. Well, me either, you know, and I remember when I was very young, 17, 18 years old, going back to France, and you could literally stumble into any little restaurant in Paris and get the most beautiful food ever. And now it's such a global idea, this idea of food. Is there one place that you think is now the kind of culinary capital of the world? I would say New York. Now, you know, because 24,000 restaurants in New York, the amount of it is unmatched anywhere in the world. And you know, when I came here, all the great restaurants were called French or continental. And all of the other restaurants with menu in French, totally, totally misspelled, but all in from there was no great Italian, Chinese, Mexican or Japanese restaurant. At that time, everything was either great French restaurant or something else. There was restaurant with meatball and pasta, but not high class. Now it's totally different. You know, there are some good French restaurants, but there is some extraordinary Chinese, Italian, Japanese and other restaurants. And the level of the palette of the people are changed so much. I mean, people going to Europe, going into wine tour, learning about wine. I mean, when I came to America, there was no bread here, no cheese, no wine. Right. You know, and now you got extraordinary wine, cheese, bread, and so forth. So it's very, very different. Do you read about food? Do you read criticism? Do you read Pete Wells? Not much anymore. No, no, you know, since the beginning of the pandemic, I've been doing those Facebook little show that for my daughter wanted me to do that. So we did like 300 of those, but otherwise, no. Well, I have one penultimate question for you, because you know, you've been around darling and you've seen the change of history. You've come through so many generations in terms of just the way you live. Is there something that you hand down to your granddaughter about your childhood, your teenage, your adulthood? Are there a few things that you tell this young woman about that are still true? Yes. I mean, you know, when I was a kid, I mean, the greatest place for a kid after coming back from school was in the kitchen, the smell of the kitchen, the noise of the instrument, you know, the voice of your mother, your father and so forth. Those are visceral days to stay with you. When Claudine was two years old, my daughter, I hold her in my hand or a year old, and I said, okay, I'll be a melange. So stir it. So she stir it. So she could eat it because she could made it. So likewise, my granddaughter, when she was five, six years old, she helped me in the kitchen. And that created a platform if you want, or a screen onto which you start having discussion, not only in the cooking process, but I mean, the sitting process and sharing the food. And that becomes very important in our family. But I think if you teach someone something specific like that, Jacques, you also teach them how to think in a way, you know, it's like learning one thing in depth. Yeah. And you need to eat every day. Okay, my last question for you, darling, tell me the headline for Eurobit and what you would like it to say. Jacques Pepin, 103, go. Yeah. I ate my last meal for a long, long, long, long time. I mean, I want to eat for like a month. A month. What is your last meal? Tell me what your last meal is. Well, from caviar to hot dog, from ham and egg to a pigeon to squab, you know, everything that I like, I would like it in front of me with all kinds of things and a lot of friends around and I would eat it until I fall dead. I did that with my dog. One of my dog had to be put to sleep many years ago and I take the best thing that he likes, steak and I hold it in my hand and the doctor gave him the shot and I fed him and he ate, he ate, he ate, and his head went down. Oh, God. That story, that's going to make me cry, darling. You must wait till the end to tell that story. That's great. Oh, boy. I did something similar with mine except with bacon because we're the same person when it comes to dog. All right. So your cookbook, I want to know about that. Okay. So I have a book coming out in September, which is cooking my way. So it's really economy in the kitchen because I just did that book of chicken a year ago or so. And that book of chicken was actually not a cookbook. I wanted to do a book of my panning of chicken and there was a hundred panning in there, but they wanted recipe right away. I said, I don't want to do recipe. So I did a little bit like I did in The Apprentice. I tell story about chicken and egg from China to France. So it was a book of story and I was surprised when on the best seller on the New York time. I can't believe that it was so successful. I've been very, very lucky. So no question about it. Lucky and hardworking and beautiful. Thank you, darling. This was an incredible chat. Thank you very much. Thank you for having me. My best. Happy cooking. Happy cooking. Happy cooking. So yet another case of someone not planning, not envisioning and yet responding to the universe and becoming literally a legend. Like this person, Jacques Pepin is a living legend. And for me, he represents everything good about French cooking. And he has taught me so much. I have to say we are kindred spirits in that we're both parsimonious. We don't like to waste stuff. We don't like to waste time. We like to clean while we cook. We're these cooks that are not just cooks, but we're also very bossy. I don't know if you've ever seen him in the kitchen with his daughter, Claudine, but he's quite a bossy chef. Even with Julia Child, he was a little bossy, right? So we have this bossiness in common. But I'll tell you, every time I am in his presence, I learn so much. That's the great gift of Jacques Pepin. Darlings, if you enjoyed this episode, do me a favor and tell someone, tell a friend, tell your mother, tell your cousin, tell everyone you know, okay? And be sure to rate the show. I love rating stuff. Go on and rate and review the show on Apple podcasts so more people can hear about it. It makes such a gigantic difference and it takes a second. So go on and do it. And if you want more fun content, videos and posts of all kinds, follow the show on Instagram and TikTok at Hello Isaac Podcast. And by the way, check me out on Instagram and TikTok at I am Isaac Mizrahi. This is Isaac Mizrahi. Thank you. I love you. And I never thought I'd say this, but goodbye, Isaac. Hello Isaac is produced by Imagine Audio, Awfully Nice, and I Am Entertainment for iHeart Media. The series is hosted by me, Isaac Mizrahi. Hello Isaac is produced by Robin Gelfenbein. The senior producers are Jesse Burton and John Asante. It is executive produced by Ron Howard, Brian Grazer, Kara Welker, and Nathan Clokey at Imagine Audio. Production management from Katie Hodges. Sound design and mixing by Cedric Wilson. Original music composed by Ben Walzer. A special thanks to Neil Phelps and Sarah Katanak at I Am Entertainment. A new podcast from the creators of Up and Vanished. Lewisville police are searching for a missing 24-year-old woman. When I read about Alana Chen's disappearance, I couldn't look away. A shy girl from Boulder who wanted to be a nun since she was a teenager. So Alana was like sneaking out to go to church. But she kept a secret, one that was slowly tearing her apart. I didn't know she was attracted to girls. Nope, she didn't tell me. Yes, the mother says her daughter first opened up to a priest at her church when she was just 14 years old. However, the church denies any conversion therapy was done. She didn't tell me. She told him. She confessed to him. From Tenderfoot TV comes a new podcast about the price we pay to belong and the systems that pay no price at all. This is Dear Alana. Listen for free on the iHeartRadio app or Apple Podcasts. For an exclusive binge of the whole season, subscribe to TenderfootPlus at tenderfootplus.com. Go anywhere in a reliable Toyota SUV, complete with the tech you need for any adventure. Like a RAV4 with available panoramic view monitoring, giving you more visibility than ever before. Or check out a Highlander, available in hybrids to combine efficiency and all the space you need. Or a Venza, available with a 12.3-inch touchscreen and premium sound system. Choose your Toyota SUV today. Visit Byattoyota.com for more and Let's Go Places."}, "podcast_summary": "Jacques Pepin, a renowned French chef and culinary expert, discusses his career and culinary philosophy in an interview. He reflects on the changes in the food industry over the years and emphasizes the importance of good ingredients and basic cooking techniques. Pepin also talks about the joy of cooking and sharing meals with loved ones. He shares stories about his experiences in the kitchen, his love for teaching, and his upcoming cookbook. Pepin's passion for food and his ability to adapt to changing times are apparent throughout the interview, making him a true legend in the culinary world.", "podcast_guest": "Jacques Pépin (French pronunciation: ​[ʒak pepɛ̃]; born December 18, 1935) is a French chef, author, culinary educator, television personality, and artist.  After having been the personal chef of French President Charles de Gaulle, he moved to the US in 1959 and after working in New York's top French restaurants, refused the same job with President John F. Kennedy in the White House and instead took a culinary development job with Howard Johnson's. During his career, he has served in numerous prestigious restaurants, first, in Paris, and then in America. He has appeared on American television and has written for The New York Times, Food & Wine and other publications. He has authored more than 30 cookbooks, some of which have become best sellers. Pépin was a longtime friend of the American chef Julia Child, and their 1999 PBS series Julia and Jacques Cooking at Home won a Daytime Emmy Award. He also holds a BA and a MA from Columbia University in French literature.\nHe has been honored with 24 James Beard Foundation Awards, five honorary doctoral degrees, the American Public Television's lifetime achievement award, the Emmy Award for Lifetime Achievement in 2019 and the Légion d'honneur, France's highest order of merit, in 2004.Since 1989, Pépin has taught in the Culinary Arts Program at Boston University and served as dean of special programs at the International Culinary Center in New York City. In 2016, with his daughter, Claudine Pépin and his son-in-law, Rollie Wesen, Pépin created the Jacques Pépin Foundation to support culinary education for adults with barriers to employment. He has lived in Connecticut since 1975.", "podcast_highlights": "In this episode, Isaac Mizrahi chats with Jacques Pepin, a renowned French chef, cookbook author, and TV personality. They discuss Pepin's culinary journey, including his early training in France, his experience working in professional kitchens, and the changes he has witnessed in the culinary industry over the years. Pepin shares his thoughts on the importance of using good quality ingredients and the value of learning culinary techniques. He also talks about his upcoming cookbook, Cooking My Way, and reflects on the highlights of his career. Throughout the conversation, Pepin emphasizes the pleasure and joy that can be found in cooking and encourages others to enjoy food and appreciate the art of cooking."}